GopalSaraf/Practicals/PSDL/include/proc/pic18f27q43.inc
// Register: DMAnAIRQ
#define DMAnAIRQ DMAnAIRQ
DMAnAIRQ                                 equ 00FEh
// bitfield definitions
DMAnAIRQ_AIRQ_POSN                       equ 0000h
DMAnAIRQ_AIRQ_POSITION                   equ 0000h
DMAnAIRQ_AIRQ_SIZE                       equ 0008h
DMAnAIRQ_AIRQ_LENGTH                     equ 0008h
DMAnAIRQ_AIRQ_MASK                       equ 00FFh
DMAnAIRQ_AIRQ0_POSN                      equ 0000h
DMAnAIRQ_AIRQ0_POSITION                  equ 0000h
DMAnAIRQ_AIRQ0_SIZE                      equ 0001h
DMAnAIRQ_AIRQ0_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ0_MASK                      equ 0001h
DMAnAIRQ_AIRQ1_POSN                      equ 0001h
DMAnAIRQ_AIRQ1_POSITION                  equ 0001h
DMAnAIRQ_AIRQ1_SIZE                      equ 0001h
DMAnAIRQ_AIRQ1_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ1_MASK                      equ 0002h
DMAnAIRQ_AIRQ2_POSN                      equ 0002h
DMAnAIRQ_AIRQ2_POSITION                  equ 0002h
DMAnAIRQ_AIRQ2_SIZE                      equ 0001h
DMAnAIRQ_AIRQ2_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ2_MASK                      equ 0004h
DMAnAIRQ_AIRQ3_POSN                      equ 0003h
DMAnAIRQ_AIRQ3_POSITION                  equ 0003h
DMAnAIRQ_AIRQ3_SIZE                      equ 0001h
DMAnAIRQ_AIRQ3_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ3_MASK                      equ 0008h
DMAnAIRQ_AIRQ4_POSN                      equ 0004h
DMAnAIRQ_AIRQ4_POSITION                  equ 0004h
DMAnAIRQ_AIRQ4_SIZE                      equ 0001h
DMAnAIRQ_AIRQ4_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ4_MASK                      equ 0010h
DMAnAIRQ_AIRQ5_POSN                      equ 0005h
DMAnAIRQ_AIRQ5_POSITION                  equ 0005h
DMAnAIRQ_AIRQ5_SIZE                      equ 0001h
DMAnAIRQ_AIRQ5_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ5_MASK                      equ 0020h
DMAnAIRQ_AIRQ6_POSN                      equ 0006h
DMAnAIRQ_AIRQ6_POSITION                  equ 0006h
DMAnAIRQ_AIRQ6_SIZE                      equ 0001h
DMAnAIRQ_AIRQ6_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ6_MASK                      equ 0040h
DMAnAIRQ_AIRQ7_POSN                      equ 0007h
DMAnAIRQ_AIRQ7_POSITION                  equ 0007h
DMAnAIRQ_AIRQ7_SIZE                      equ 0001h
DMAnAIRQ_AIRQ7_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ7_MASK                      equ 0080h

// Register: DMAnSIRQ
#define DMAnSIRQ DMAnSIRQ
DMAnSIRQ                                 equ 00FFh
// bitfield definitions
DMAnSIRQ_SIRQ_POSN                       equ 0000h
DMAnSIRQ_SIRQ_POSITION                   equ 0000h
DMAnSIRQ_SIRQ_SIZE                       equ 0008h
DMAnSIRQ_SIRQ_LENGTH                     equ 0008h
DMAnSIRQ_SIRQ_MASK                       equ 00FFh
DMAnSIRQ_SIRQ0_POSN                      equ 0000h
DMAnSIRQ_SIRQ0_POSITION                  equ 0000h
DMAnSIRQ_SIRQ0_SIZE                      equ 0001h
DMAnSIRQ_SIRQ0_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ0_MASK                      equ 0001h
DMAnSIRQ_SIRQ1_POSN                      equ 0001h
DMAnSIRQ_SIRQ1_POSITION                  equ 0001h
DMAnSIRQ_SIRQ1_SIZE                      equ 0001h
DMAnSIRQ_SIRQ1_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ1_MASK                      equ 0002h
DMAnSIRQ_SIRQ2_POSN                      equ 0002h
DMAnSIRQ_SIRQ2_POSITION                  equ 0002h
DMAnSIRQ_SIRQ2_SIZE                      equ 0001h
DMAnSIRQ_SIRQ2_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ2_MASK                      equ 0004h
DMAnSIRQ_SIRQ3_POSN                      equ 0003h
DMAnSIRQ_SIRQ3_POSITION                  equ 0003h
DMAnSIRQ_SIRQ3_SIZE                      equ 0001h
DMAnSIRQ_SIRQ3_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ3_MASK                      equ 0008h
DMAnSIRQ_SIRQ4_POSN                      equ 0004h
DMAnSIRQ_SIRQ4_POSITION                  equ 0004h
DMAnSIRQ_SIRQ4_SIZE                      equ 0001h
DMAnSIRQ_SIRQ4_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ4_MASK                      equ 0010h
DMAnSIRQ_SIRQ5_POSN                      equ 0005h
DMAnSIRQ_SIRQ5_POSITION                  equ 0005h
DMAnSIRQ_SIRQ5_SIZE                      equ 0001h
DMAnSIRQ_SIRQ5_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ5_MASK                      equ 0020h
DMAnSIRQ_SIRQ6_POSN                      equ 0006h
DMAnSIRQ_SIRQ6_POSITION                  equ 0006h
DMAnSIRQ_SIRQ6_SIZE                      equ 0001h
DMAnSIRQ_SIRQ6_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ6_MASK                      equ 0040h
DMAnSIRQ_SIRQ7_POSN                      equ 0007h
DMAnSIRQ_SIRQ7_POSITION                  equ 0007h
DMAnSIRQ_SIRQ7_SIZE                      equ 0001h
DMAnSIRQ_SIRQ7_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ7_MASK                      equ 0080h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 0200h
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 0201h
// bitfield definitions
RA0PPS_RA0PPS0_POSN                      equ 0000h
RA0PPS_RA0PPS0_POSITION                  equ 0000h
RA0PPS_RA0PPS0_SIZE                      equ 0001h
RA0PPS_RA0PPS0_LENGTH                    equ 0001h
RA0PPS_RA0PPS0_MASK                      equ 0001h
RA0PPS_RA0PPS1_POSN                      equ 0001h
RA0PPS_RA0PPS1_POSITION                  equ 0001h
RA0PPS_RA0PPS1_SIZE                      equ 0001h
RA0PPS_RA0PPS1_LENGTH                    equ 0001h
RA0PPS_RA0PPS1_MASK                      equ 0002h
RA0PPS_RA0PPS2_POSN                      equ 0002h
RA0PPS_RA0PPS2_POSITION                  equ 0002h
RA0PPS_RA0PPS2_SIZE                      equ 0001h
RA0PPS_RA0PPS2_LENGTH                    equ 0001h
RA0PPS_RA0PPS2_MASK                      equ 0004h
RA0PPS_RA0PPS3_POSN                      equ 0003h
RA0PPS_RA0PPS3_POSITION                  equ 0003h
RA0PPS_RA0PPS3_SIZE                      equ 0001h
RA0PPS_RA0PPS3_LENGTH                    equ 0001h
RA0PPS_RA0PPS3_MASK                      equ 0008h
RA0PPS_RA0PPS4_POSN                      equ 0004h
RA0PPS_RA0PPS4_POSITION                  equ 0004h
RA0PPS_RA0PPS4_SIZE                      equ 0001h
RA0PPS_RA0PPS4_LENGTH                    equ 0001h
RA0PPS_RA0PPS4_MASK                      equ 0010h
RA0PPS_RA0PPS5_POSN                      equ 0005h
RA0PPS_RA0PPS5_POSITION                  equ 0005h
RA0PPS_RA0PPS5_SIZE                      equ 0001h
RA0PPS_RA0PPS5_LENGTH                    equ 0001h
RA0PPS_RA0PPS5_MASK                      equ 0020h
RA0PPS_RA0PPS6_POSN                      equ 0006h
RA0PPS_RA0PPS6_POSITION                  equ 0006h
RA0PPS_RA0PPS6_SIZE                      equ 0001h
RA0PPS_RA0PPS6_LENGTH                    equ 0001h
RA0PPS_RA0PPS6_MASK                      equ 0040h

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 0202h
// bitfield definitions
RA1PPS_RA1PPS0_POSN                      equ 0000h
RA1PPS_RA1PPS0_POSITION                  equ 0000h
RA1PPS_RA1PPS0_SIZE                      equ 0001h
RA1PPS_RA1PPS0_LENGTH                    equ 0001h
RA1PPS_RA1PPS0_MASK                      equ 0001h
RA1PPS_RA1PPS1_POSN                      equ 0001h
RA1PPS_RA1PPS1_POSITION                  equ 0001h
RA1PPS_RA1PPS1_SIZE                      equ 0001h
RA1PPS_RA1PPS1_LENGTH                    equ 0001h
RA1PPS_RA1PPS1_MASK                      equ 0002h
RA1PPS_RA1PPS2_POSN                      equ 0002h
RA1PPS_RA1PPS2_POSITION                  equ 0002h
RA1PPS_RA1PPS2_SIZE                      equ 0001h
RA1PPS_RA1PPS2_LENGTH                    equ 0001h
RA1PPS_RA1PPS2_MASK                      equ 0004h
RA1PPS_RA1PPS3_POSN                      equ 0003h
RA1PPS_RA1PPS3_POSITION                  equ 0003h
RA1PPS_RA1PPS3_SIZE                      equ 0001h
RA1PPS_RA1PPS3_LENGTH                    equ 0001h
RA1PPS_RA1PPS3_MASK                      equ 0008h
RA1PPS_RA1PPS4_POSN                      equ 0004h
RA1PPS_RA1PPS4_POSITION                  equ 0004h
RA1PPS_RA1PPS4_SIZE                      equ 0001h
RA1PPS_RA1PPS4_LENGTH                    equ 0001h
RA1PPS_RA1PPS4_MASK                      equ 0010h
RA1PPS_RA1PPS5_POSN                      equ 0005h
RA1PPS_RA1PPS5_POSITION                  equ 0005h
RA1PPS_RA1PPS5_SIZE                      equ 0001h
RA1PPS_RA1PPS5_LENGTH                    equ 0001h
RA1PPS_RA1PPS5_MASK                      equ 0020h
RA1PPS_RA1PPS6_POSN                      equ 0006h
RA1PPS_RA1PPS6_POSITION                  equ 0006h
RA1PPS_RA1PPS6_SIZE                      equ 0001h
RA1PPS_RA1PPS6_LENGTH                    equ 0001h
RA1PPS_RA1PPS6_MASK                      equ 0040h

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 0203h
// bitfield definitions
RA2PPS_RA2PPS0_POSN                      equ 0000h
RA2PPS_RA2PPS0_POSITION                  equ 0000h
RA2PPS_RA2PPS0_SIZE                      equ 0001h
RA2PPS_RA2PPS0_LENGTH                    equ 0001h
RA2PPS_RA2PPS0_MASK                      equ 0001h
RA2PPS_RA2PPS1_POSN                      equ 0001h
RA2PPS_RA2PPS1_POSITION                  equ 0001h
RA2PPS_RA2PPS1_SIZE                      equ 0001h
RA2PPS_RA2PPS1_LENGTH                    equ 0001h
RA2PPS_RA2PPS1_MASK                      equ 0002h
RA2PPS_RA2PPS2_POSN                      equ 0002h
RA2PPS_RA2PPS2_POSITION                  equ 0002h
RA2PPS_RA2PPS2_SIZE                      equ 0001h
RA2PPS_RA2PPS2_LENGTH                    equ 0001h
RA2PPS_RA2PPS2_MASK                      equ 0004h
RA2PPS_RA2PPS3_POSN                      equ 0003h
RA2PPS_RA2PPS3_POSITION                  equ 0003h
RA2PPS_RA2PPS3_SIZE                      equ 0001h
RA2PPS_RA2PPS3_LENGTH                    equ 0001h
RA2PPS_RA2PPS3_MASK                      equ 0008h
RA2PPS_RA2PPS4_POSN                      equ 0004h
RA2PPS_RA2PPS4_POSITION                  equ 0004h
RA2PPS_RA2PPS4_SIZE                      equ 0001h
RA2PPS_RA2PPS4_LENGTH                    equ 0001h
RA2PPS_RA2PPS4_MASK                      equ 0010h
RA2PPS_RA2PPS5_POSN                      equ 0005h
RA2PPS_RA2PPS5_POSITION                  equ 0005h
RA2PPS_RA2PPS5_SIZE                      equ 0001h
RA2PPS_RA2PPS5_LENGTH                    equ 0001h
RA2PPS_RA2PPS5_MASK                      equ 0020h
RA2PPS_RA2PPS6_POSN                      equ 0006h
RA2PPS_RA2PPS6_POSITION                  equ 0006h
RA2PPS_RA2PPS6_SIZE                      equ 0001h
RA2PPS_RA2PPS6_LENGTH                    equ 0001h
RA2PPS_RA2PPS6_MASK                      equ 0040h

