GopalSaraf/Practicals/PSDL/include/proc/pic18f27q43.inc
// Register: U4UIR
#define U4UIR U4UIR
U4UIR                                    equ 02EAh
// bitfield definitions
U4UIR_ABDIE_POSN                         equ 0002h
U4UIR_ABDIE_POSITION                     equ 0002h
U4UIR_ABDIE_SIZE                         equ 0001h
U4UIR_ABDIE_LENGTH                       equ 0001h
U4UIR_ABDIE_MASK                         equ 0004h
U4UIR_ABDIF_POSN                         equ 0006h
U4UIR_ABDIF_POSITION                     equ 0006h
U4UIR_ABDIF_SIZE                         equ 0001h
U4UIR_ABDIF_LENGTH                       equ 0001h
U4UIR_ABDIF_MASK                         equ 0040h
U4UIR_WUIF_POSN                          equ 0007h
U4UIR_WUIF_POSITION                      equ 0007h
U4UIR_WUIF_SIZE                          equ 0001h
U4UIR_WUIF_LENGTH                        equ 0001h
U4UIR_WUIF_MASK                          equ 0080h
U4UIR_U4ABDIE_POSN                       equ 0002h
U4UIR_U4ABDIE_POSITION                   equ 0002h
U4UIR_U4ABDIE_SIZE                       equ 0001h
U4UIR_U4ABDIE_LENGTH                     equ 0001h
U4UIR_U4ABDIE_MASK                       equ 0004h
U4UIR_U4ABDIF_POSN                       equ 0006h
U4UIR_U4ABDIF_POSITION                   equ 0006h
U4UIR_U4ABDIF_SIZE                       equ 0001h
U4UIR_U4ABDIF_LENGTH                     equ 0001h
U4UIR_U4ABDIF_MASK                       equ 0040h
U4UIR_U4WUIF_POSN                        equ 0007h
U4UIR_U4WUIF_POSITION                    equ 0007h
U4UIR_U4WUIF_SIZE                        equ 0001h
U4UIR_U4WUIF_LENGTH                      equ 0001h
U4UIR_U4WUIF_MASK                        equ 0080h

// Register: U4ERRIR
#define U4ERRIR U4ERRIR
U4ERRIR                                  equ 02EBh
// bitfield definitions
U4ERRIR_TXCIF_POSN                       equ 0000h
U4ERRIR_TXCIF_POSITION                   equ 0000h
U4ERRIR_TXCIF_SIZE                       equ 0001h
U4ERRIR_TXCIF_LENGTH                     equ 0001h
U4ERRIR_TXCIF_MASK                       equ 0001h
U4ERRIR_RXFOIF_POSN                      equ 0001h
U4ERRIR_RXFOIF_POSITION                  equ 0001h
U4ERRIR_RXFOIF_SIZE                      equ 0001h
U4ERRIR_RXFOIF_LENGTH                    equ 0001h
U4ERRIR_RXFOIF_MASK                      equ 0002h
U4ERRIR_RXBKIF_POSN                      equ 0002h
U4ERRIR_RXBKIF_POSITION                  equ 0002h
U4ERRIR_RXBKIF_SIZE                      equ 0001h
U4ERRIR_RXBKIF_LENGTH                    equ 0001h
U4ERRIR_RXBKIF_MASK                      equ 0004h
U4ERRIR_FERIF_POSN                       equ 0003h
U4ERRIR_FERIF_POSITION                   equ 0003h
U4ERRIR_FERIF_SIZE                       equ 0001h
U4ERRIR_FERIF_LENGTH                     equ 0001h
U4ERRIR_FERIF_MASK                       equ 0008h
U4ERRIR_CERIF_POSN                       equ 0004h
U4ERRIR_CERIF_POSITION                   equ 0004h
U4ERRIR_CERIF_SIZE                       equ 0001h
U4ERRIR_CERIF_LENGTH                     equ 0001h
U4ERRIR_CERIF_MASK                       equ 0010h
U4ERRIR_ABDOVF_POSN                      equ 0005h
U4ERRIR_ABDOVF_POSITION                  equ 0005h
U4ERRIR_ABDOVF_SIZE                      equ 0001h
U4ERRIR_ABDOVF_LENGTH                    equ 0001h
U4ERRIR_ABDOVF_MASK                      equ 0020h
U4ERRIR_PERIF_POSN                       equ 0006h
U4ERRIR_PERIF_POSITION                   equ 0006h
U4ERRIR_PERIF_SIZE                       equ 0001h
U4ERRIR_PERIF_LENGTH                     equ 0001h
U4ERRIR_PERIF_MASK                       equ 0040h
U4ERRIR_TXMTIF_POSN                      equ 0007h
U4ERRIR_TXMTIF_POSITION                  equ 0007h
U4ERRIR_TXMTIF_SIZE                      equ 0001h
U4ERRIR_TXMTIF_LENGTH                    equ 0001h
U4ERRIR_TXMTIF_MASK                      equ 0080h
U4ERRIR_U4TXCIF_POSN                     equ 0000h
U4ERRIR_U4TXCIF_POSITION                 equ 0000h
U4ERRIR_U4TXCIF_SIZE                     equ 0001h
U4ERRIR_U4TXCIF_LENGTH                   equ 0001h
U4ERRIR_U4TXCIF_MASK                     equ 0001h
U4ERRIR_U4RXFOIF_POSN                    equ 0001h
U4ERRIR_U4RXFOIF_POSITION                equ 0001h
U4ERRIR_U4RXFOIF_SIZE                    equ 0001h
U4ERRIR_U4RXFOIF_LENGTH                  equ 0001h
U4ERRIR_U4RXFOIF_MASK                    equ 0002h
U4ERRIR_U4RXBKIF_POSN                    equ 0002h
U4ERRIR_U4RXBKIF_POSITION                equ 0002h
U4ERRIR_U4RXBKIF_SIZE                    equ 0001h
U4ERRIR_U4RXBKIF_LENGTH                  equ 0001h
U4ERRIR_U4RXBKIF_MASK                    equ 0004h
U4ERRIR_U4FERIF_POSN                     equ 0003h
U4ERRIR_U4FERIF_POSITION                 equ 0003h
U4ERRIR_U4FERIF_SIZE                     equ 0001h
U4ERRIR_U4FERIF_LENGTH                   equ 0001h
U4ERRIR_U4FERIF_MASK                     equ 0008h
U4ERRIR_U4CERIF_POSN                     equ 0004h
U4ERRIR_U4CERIF_POSITION                 equ 0004h
U4ERRIR_U4CERIF_SIZE                     equ 0001h
U4ERRIR_U4CERIF_LENGTH                   equ 0001h
U4ERRIR_U4CERIF_MASK                     equ 0010h
U4ERRIR_U4ABDOVF_POSN                    equ 0005h
U4ERRIR_U4ABDOVF_POSITION                equ 0005h
U4ERRIR_U4ABDOVF_SIZE                    equ 0001h
U4ERRIR_U4ABDOVF_LENGTH                  equ 0001h
U4ERRIR_U4ABDOVF_MASK                    equ 0020h
U4ERRIR_U4PERIF_POSN                     equ 0006h
U4ERRIR_U4PERIF_POSITION                 equ 0006h
U4ERRIR_U4PERIF_SIZE                     equ 0001h
U4ERRIR_U4PERIF_LENGTH                   equ 0001h
U4ERRIR_U4PERIF_MASK                     equ 0040h
U4ERRIR_U4TXMTIF_POSN                    equ 0007h
U4ERRIR_U4TXMTIF_POSITION                equ 0007h
U4ERRIR_U4TXMTIF_SIZE                    equ 0001h
U4ERRIR_U4TXMTIF_LENGTH                  equ 0001h
U4ERRIR_U4TXMTIF_MASK                    equ 0080h

// Register: U4ERRIE
#define U4ERRIE U4ERRIE
U4ERRIE                                  equ 02ECh
// bitfield definitions
U4ERRIE_TXCIE_POSN                       equ 0000h
U4ERRIE_TXCIE_POSITION                   equ 0000h
U4ERRIE_TXCIE_SIZE                       equ 0001h
U4ERRIE_TXCIE_LENGTH                     equ 0001h
U4ERRIE_TXCIE_MASK                       equ 0001h
U4ERRIE_RXFOIE_POSN                      equ 0001h
U4ERRIE_RXFOIE_POSITION                  equ 0001h
U4ERRIE_RXFOIE_SIZE                      equ 0001h
U4ERRIE_RXFOIE_LENGTH                    equ 0001h
U4ERRIE_RXFOIE_MASK                      equ 0002h
U4ERRIE_RXBKIE_POSN                      equ 0002h
U4ERRIE_RXBKIE_POSITION                  equ 0002h
U4ERRIE_RXBKIE_SIZE                      equ 0001h
U4ERRIE_RXBKIE_LENGTH                    equ 0001h
U4ERRIE_RXBKIE_MASK                      equ 0004h
U4ERRIE_FERIE_POSN                       equ 0003h
U4ERRIE_FERIE_POSITION                   equ 0003h
U4ERRIE_FERIE_SIZE                       equ 0001h
U4ERRIE_FERIE_LENGTH                     equ 0001h
U4ERRIE_FERIE_MASK                       equ 0008h
U4ERRIE_CERIE_POSN                       equ 0004h
U4ERRIE_CERIE_POSITION                   equ 0004h
U4ERRIE_CERIE_SIZE                       equ 0001h
U4ERRIE_CERIE_LENGTH                     equ 0001h
U4ERRIE_CERIE_MASK                       equ 0010h
U4ERRIE_ABDOVE_POSN                      equ 0005h
U4ERRIE_ABDOVE_POSITION                  equ 0005h
U4ERRIE_ABDOVE_SIZE                      equ 0001h
U4ERRIE_ABDOVE_LENGTH                    equ 0001h
U4ERRIE_ABDOVE_MASK                      equ 0020h
U4ERRIE_PERIE_POSN                       equ 0006h
U4ERRIE_PERIE_POSITION                   equ 0006h
U4ERRIE_PERIE_SIZE                       equ 0001h
U4ERRIE_PERIE_LENGTH                     equ 0001h
U4ERRIE_PERIE_MASK                       equ 0040h
U4ERRIE_TXMTIE_POSN                      equ 0007h
U4ERRIE_TXMTIE_POSITION                  equ 0007h
U4ERRIE_TXMTIE_SIZE                      equ 0001h
U4ERRIE_TXMTIE_LENGTH                    equ 0001h
U4ERRIE_TXMTIE_MASK                      equ 0080h
U4ERRIE_U4TXCIE_POSN                     equ 0000h
U4ERRIE_U4TXCIE_POSITION                 equ 0000h
U4ERRIE_U4TXCIE_SIZE                     equ 0001h
U4ERRIE_U4TXCIE_LENGTH                   equ 0001h
U4ERRIE_U4TXCIE_MASK                     equ 0001h
U4ERRIE_U4RXFOIE_POSN                    equ 0001h
U4ERRIE_U4RXFOIE_POSITION                equ 0001h
U4ERRIE_U4RXFOIE_SIZE                    equ 0001h
U4ERRIE_U4RXFOIE_LENGTH                  equ 0001h
U4ERRIE_U4RXFOIE_MASK                    equ 0002h
U4ERRIE_U4RXBKIE_POSN                    equ 0002h
U4ERRIE_U4RXBKIE_POSITION                equ 0002h
U4ERRIE_U4RXBKIE_SIZE                    equ 0001h
U4ERRIE_U4RXBKIE_LENGTH                  equ 0001h
U4ERRIE_U4RXBKIE_MASK                    equ 0004h
U4ERRIE_U4FERIE_POSN                     equ 0003h
U4ERRIE_U4FERIE_POSITION                 equ 0003h
U4ERRIE_U4FERIE_SIZE                     equ 0001h
U4ERRIE_U4FERIE_LENGTH                   equ 0001h
U4ERRIE_U4FERIE_MASK                     equ 0008h
U4ERRIE_U4CERIE_POSN                     equ 0004h
U4ERRIE_U4CERIE_POSITION                 equ 0004h
U4ERRIE_U4CERIE_SIZE                     equ 0001h
U4ERRIE_U4CERIE_LENGTH                   equ 0001h
U4ERRIE_U4CERIE_MASK                     equ 0010h
U4ERRIE_U4ABDOVE_POSN                    equ 0005h
U4ERRIE_U4ABDOVE_POSITION                equ 0005h
U4ERRIE_U4ABDOVE_SIZE                    equ 0001h
U4ERRIE_U4ABDOVE_LENGTH                  equ 0001h
U4ERRIE_U4ABDOVE_MASK                    equ 0020h
U4ERRIE_U4PERIE_POSN                     equ 0006h
U4ERRIE_U4PERIE_POSITION                 equ 0006h
U4ERRIE_U4PERIE_SIZE                     equ 0001h
U4ERRIE_U4PERIE_LENGTH                   equ 0001h
U4ERRIE_U4PERIE_MASK                     equ 0040h
U4ERRIE_U4TXMTIE_POSN                    equ 0007h
U4ERRIE_U4TXMTIE_POSITION                equ 0007h
U4ERRIE_U4TXMTIE_SIZE                    equ 0001h
U4ERRIE_U4TXMTIE_LENGTH                  equ 0001h
U4ERRIE_U4TXMTIE_MASK                    equ 0080h

// Register: U5RXB
#define U5RXB U5RXB
U5RXB                                    equ 02EDh
// bitfield definitions
U5RXB_RXB_POSN                           equ 0000h
U5RXB_RXB_POSITION                       equ 0000h
U5RXB_RXB_SIZE                           equ 0008h
U5RXB_RXB_LENGTH                         equ 0008h
U5RXB_RXB_MASK                           equ 00FFh

// Register: U5TXB
#define U5TXB U5TXB
U5TXB                                    equ 02EFh
// bitfield definitions
U5TXB_TXB_POSN                           equ 0000h
U5TXB_TXB_POSITION                       equ 0000h
U5TXB_TXB_SIZE                           equ 0008h
U5TXB_TXB_LENGTH                         equ 0008h
U5TXB_TXB_MASK                           equ 00FFh

// Register: U5P1
#define U5P1 U5P1
U5P1                                     equ 02F1h

// Register: U5P1L
#define U5P1L U5P1L
U5P1L                                    equ 02F1h
// bitfield definitions
U5P1L_P1L_POSN                           equ 0000h
U5P1L_P1L_POSITION                       equ 0000h
U5P1L_P1L_SIZE                           equ 0008h
U5P1L_P1L_LENGTH                         equ 0008h
U5P1L_P1L_MASK                           equ 00FFh

// Register: U5P2
#define U5P2 U5P2
U5P2                                     equ 02F3h

// Register: U5P2L
#define U5P2L U5P2L
U5P2L                                    equ 02F3h
// bitfield definitions
U5P2L_P2L_POSN                           equ 0000h
U5P2L_P2L_POSITION                       equ 0000h
U5P2L_P2L_SIZE                           equ 0008h
U5P2L_P2L_LENGTH                         equ 0008h
U5P2L_P2L_MASK                           equ 00FFh

// Register: U5P3
#define U5P3 U5P3
U5P3                                     equ 02F5h

