GopalSaraf/Practicals/PSDL/include/proc/pic18f27q43.inc
// Register: NCO3ACC
#define NCO3ACC NCO3ACC
NCO3ACC                                  equ 0450h

// Register: NCO3ACCL
#define NCO3ACCL NCO3ACCL
NCO3ACCL                                 equ 0450h
// bitfield definitions
NCO3ACCL_ACC_POSN                        equ 0000h
NCO3ACCL_ACC_POSITION                    equ 0000h
NCO3ACCL_ACC_SIZE                        equ 0008h
NCO3ACCL_ACC_LENGTH                      equ 0008h
NCO3ACCL_ACC_MASK                        equ 00FFh
NCO3ACCL_NCO3ACC0_POSN                   equ 0000h
NCO3ACCL_NCO3ACC0_POSITION               equ 0000h
NCO3ACCL_NCO3ACC0_SIZE                   equ 0001h
NCO3ACCL_NCO3ACC0_LENGTH                 equ 0001h
NCO3ACCL_NCO3ACC0_MASK                   equ 0001h
NCO3ACCL_NCO3ACC1_POSN                   equ 0001h
NCO3ACCL_NCO3ACC1_POSITION               equ 0001h
NCO3ACCL_NCO3ACC1_SIZE                   equ 0001h
NCO3ACCL_NCO3ACC1_LENGTH                 equ 0001h
NCO3ACCL_NCO3ACC1_MASK                   equ 0002h
NCO3ACCL_NCO3ACC2_POSN                   equ 0002h
NCO3ACCL_NCO3ACC2_POSITION               equ 0002h
NCO3ACCL_NCO3ACC2_SIZE                   equ 0001h
NCO3ACCL_NCO3ACC2_LENGTH                 equ 0001h
NCO3ACCL_NCO3ACC2_MASK                   equ 0004h
NCO3ACCL_NCO3ACC3_POSN                   equ 0003h
NCO3ACCL_NCO3ACC3_POSITION               equ 0003h
NCO3ACCL_NCO3ACC3_SIZE                   equ 0001h
NCO3ACCL_NCO3ACC3_LENGTH                 equ 0001h
NCO3ACCL_NCO3ACC3_MASK                   equ 0008h
NCO3ACCL_NCO3ACC4_POSN                   equ 0004h
NCO3ACCL_NCO3ACC4_POSITION               equ 0004h
NCO3ACCL_NCO3ACC4_SIZE                   equ 0001h
NCO3ACCL_NCO3ACC4_LENGTH                 equ 0001h
NCO3ACCL_NCO3ACC4_MASK                   equ 0010h
NCO3ACCL_NCO3ACC5_POSN                   equ 0005h
NCO3ACCL_NCO3ACC5_POSITION               equ 0005h
NCO3ACCL_NCO3ACC5_SIZE                   equ 0001h
NCO3ACCL_NCO3ACC5_LENGTH                 equ 0001h
NCO3ACCL_NCO3ACC5_MASK                   equ 0020h
NCO3ACCL_NCO3ACC6_POSN                   equ 0006h
NCO3ACCL_NCO3ACC6_POSITION               equ 0006h
NCO3ACCL_NCO3ACC6_SIZE                   equ 0001h
NCO3ACCL_NCO3ACC6_LENGTH                 equ 0001h
NCO3ACCL_NCO3ACC6_MASK                   equ 0040h
NCO3ACCL_NCO3ACC7_POSN                   equ 0007h
NCO3ACCL_NCO3ACC7_POSITION               equ 0007h
NCO3ACCL_NCO3ACC7_SIZE                   equ 0001h
NCO3ACCL_NCO3ACC7_LENGTH                 equ 0001h
NCO3ACCL_NCO3ACC7_MASK                   equ 0080h
NCO3ACCL_ACC0_POSN                       equ 0000h
NCO3ACCL_ACC0_POSITION                   equ 0000h
NCO3ACCL_ACC0_SIZE                       equ 0001h
NCO3ACCL_ACC0_LENGTH                     equ 0001h
NCO3ACCL_ACC0_MASK                       equ 0001h
NCO3ACCL_ACC1_POSN                       equ 0001h
NCO3ACCL_ACC1_POSITION                   equ 0001h
NCO3ACCL_ACC1_SIZE                       equ 0001h
NCO3ACCL_ACC1_LENGTH                     equ 0001h
NCO3ACCL_ACC1_MASK                       equ 0002h
NCO3ACCL_ACC2_POSN                       equ 0002h
NCO3ACCL_ACC2_POSITION                   equ 0002h
NCO3ACCL_ACC2_SIZE                       equ 0001h
NCO3ACCL_ACC2_LENGTH                     equ 0001h
NCO3ACCL_ACC2_MASK                       equ 0004h
NCO3ACCL_ACC3_POSN                       equ 0003h
NCO3ACCL_ACC3_POSITION                   equ 0003h
NCO3ACCL_ACC3_SIZE                       equ 0001h
NCO3ACCL_ACC3_LENGTH                     equ 0001h
NCO3ACCL_ACC3_MASK                       equ 0008h
NCO3ACCL_ACC4_POSN                       equ 0004h
NCO3ACCL_ACC4_POSITION                   equ 0004h
NCO3ACCL_ACC4_SIZE                       equ 0001h
NCO3ACCL_ACC4_LENGTH                     equ 0001h
NCO3ACCL_ACC4_MASK                       equ 0010h
NCO3ACCL_ACC5_POSN                       equ 0005h
NCO3ACCL_ACC5_POSITION                   equ 0005h
NCO3ACCL_ACC5_SIZE                       equ 0001h
NCO3ACCL_ACC5_LENGTH                     equ 0001h
NCO3ACCL_ACC5_MASK                       equ 0020h
NCO3ACCL_ACC6_POSN                       equ 0006h
NCO3ACCL_ACC6_POSITION                   equ 0006h
NCO3ACCL_ACC6_SIZE                       equ 0001h
NCO3ACCL_ACC6_LENGTH                     equ 0001h
NCO3ACCL_ACC6_MASK                       equ 0040h
NCO3ACCL_ACC7_POSN                       equ 0007h
NCO3ACCL_ACC7_POSITION                   equ 0007h
NCO3ACCL_ACC7_SIZE                       equ 0001h
NCO3ACCL_ACC7_LENGTH                     equ 0001h
NCO3ACCL_ACC7_MASK                       equ 0080h
NCO3ACCL_NCO3ACC_POSN                    equ 0000h
NCO3ACCL_NCO3ACC_POSITION                equ 0000h
NCO3ACCL_NCO3ACC_SIZE                    equ 0008h
NCO3ACCL_NCO3ACC_LENGTH                  equ 0008h
NCO3ACCL_NCO3ACC_MASK                    equ 00FFh

// Register: NCO3ACCH
#define NCO3ACCH NCO3ACCH
NCO3ACCH                                 equ 0451h
// bitfield definitions
NCO3ACCH_ACC_POSN                        equ 0000h
NCO3ACCH_ACC_POSITION                    equ 0000h
NCO3ACCH_ACC_SIZE                        equ 0008h
NCO3ACCH_ACC_LENGTH                      equ 0008h
NCO3ACCH_ACC_MASK                        equ 00FFh
NCO3ACCH_NCO3ACC8_POSN                   equ 0000h
NCO3ACCH_NCO3ACC8_POSITION               equ 0000h
NCO3ACCH_NCO3ACC8_SIZE                   equ 0001h
NCO3ACCH_NCO3ACC8_LENGTH                 equ 0001h
NCO3ACCH_NCO3ACC8_MASK                   equ 0001h
NCO3ACCH_NCO3ACC9_POSN                   equ 0001h
NCO3ACCH_NCO3ACC9_POSITION               equ 0001h
NCO3ACCH_NCO3ACC9_SIZE                   equ 0001h
NCO3ACCH_NCO3ACC9_LENGTH                 equ 0001h
NCO3ACCH_NCO3ACC9_MASK                   equ 0002h
NCO3ACCH_NCO3ACC10_POSN                  equ 0002h
NCO3ACCH_NCO3ACC10_POSITION              equ 0002h
NCO3ACCH_NCO3ACC10_SIZE                  equ 0001h
NCO3ACCH_NCO3ACC10_LENGTH                equ 0001h
NCO3ACCH_NCO3ACC10_MASK                  equ 0004h
NCO3ACCH_NCO3ACC11_POSN                  equ 0003h
NCO3ACCH_NCO3ACC11_POSITION              equ 0003h
NCO3ACCH_NCO3ACC11_SIZE                  equ 0001h
NCO3ACCH_NCO3ACC11_LENGTH                equ 0001h
NCO3ACCH_NCO3ACC11_MASK                  equ 0008h
NCO3ACCH_NCO3ACC12_POSN                  equ 0004h
NCO3ACCH_NCO3ACC12_POSITION              equ 0004h
NCO3ACCH_NCO3ACC12_SIZE                  equ 0001h
NCO3ACCH_NCO3ACC12_LENGTH                equ 0001h
NCO3ACCH_NCO3ACC12_MASK                  equ 0010h
NCO3ACCH_NCO3ACC13_POSN                  equ 0005h
NCO3ACCH_NCO3ACC13_POSITION              equ 0005h
NCO3ACCH_NCO3ACC13_SIZE                  equ 0001h
NCO3ACCH_NCO3ACC13_LENGTH                equ 0001h
NCO3ACCH_NCO3ACC13_MASK                  equ 0020h
NCO3ACCH_NCO3ACC14_POSN                  equ 0006h
NCO3ACCH_NCO3ACC14_POSITION              equ 0006h
NCO3ACCH_NCO3ACC14_SIZE                  equ 0001h
NCO3ACCH_NCO3ACC14_LENGTH                equ 0001h
NCO3ACCH_NCO3ACC14_MASK                  equ 0040h
NCO3ACCH_NCO3ACC15_POSN                  equ 0007h
NCO3ACCH_NCO3ACC15_POSITION              equ 0007h
NCO3ACCH_NCO3ACC15_SIZE                  equ 0001h
NCO3ACCH_NCO3ACC15_LENGTH                equ 0001h
NCO3ACCH_NCO3ACC15_MASK                  equ 0080h
NCO3ACCH_ACC8_POSN                       equ 0000h
NCO3ACCH_ACC8_POSITION                   equ 0000h
NCO3ACCH_ACC8_SIZE                       equ 0001h
NCO3ACCH_ACC8_LENGTH                     equ 0001h
NCO3ACCH_ACC8_MASK                       equ 0001h
NCO3ACCH_ACC9_POSN                       equ 0001h
NCO3ACCH_ACC9_POSITION                   equ 0001h
NCO3ACCH_ACC9_SIZE                       equ 0001h
NCO3ACCH_ACC9_LENGTH                     equ 0001h
NCO3ACCH_ACC9_MASK                       equ 0002h
NCO3ACCH_ACC10_POSN                      equ 0002h
NCO3ACCH_ACC10_POSITION                  equ 0002h
NCO3ACCH_ACC10_SIZE                      equ 0001h
NCO3ACCH_ACC10_LENGTH                    equ 0001h
NCO3ACCH_ACC10_MASK                      equ 0004h
NCO3ACCH_ACC11_POSN                      equ 0003h
NCO3ACCH_ACC11_POSITION                  equ 0003h
NCO3ACCH_ACC11_SIZE                      equ 0001h
NCO3ACCH_ACC11_LENGTH                    equ 0001h
NCO3ACCH_ACC11_MASK                      equ 0008h
NCO3ACCH_ACC12_POSN                      equ 0004h
NCO3ACCH_ACC12_POSITION                  equ 0004h
NCO3ACCH_ACC12_SIZE                      equ 0001h
NCO3ACCH_ACC12_LENGTH                    equ 0001h
NCO3ACCH_ACC12_MASK                      equ 0010h
NCO3ACCH_ACC13_POSN                      equ 0005h
NCO3ACCH_ACC13_POSITION                  equ 0005h
NCO3ACCH_ACC13_SIZE                      equ 0001h
NCO3ACCH_ACC13_LENGTH                    equ 0001h
NCO3ACCH_ACC13_MASK                      equ 0020h
NCO3ACCH_ACC14_POSN                      equ 0006h
NCO3ACCH_ACC14_POSITION                  equ 0006h
NCO3ACCH_ACC14_SIZE                      equ 0001h
NCO3ACCH_ACC14_LENGTH                    equ 0001h
NCO3ACCH_ACC14_MASK                      equ 0040h
NCO3ACCH_ACC15_POSN                      equ 0007h
NCO3ACCH_ACC15_POSITION                  equ 0007h
NCO3ACCH_ACC15_SIZE                      equ 0001h
NCO3ACCH_ACC15_LENGTH                    equ 0001h
NCO3ACCH_ACC15_MASK                      equ 0080h
NCO3ACCH_NCO3ACC_POSN                    equ 0000h
NCO3ACCH_NCO3ACC_POSITION                equ 0000h
NCO3ACCH_NCO3ACC_SIZE                    equ 0008h
NCO3ACCH_NCO3ACC_LENGTH                  equ 0008h
NCO3ACCH_NCO3ACC_MASK                    equ 00FFh

