GopalSaraf/Practicals/PSDL/include/proc/pic18f27q43.inc
// Register: PIE11
#define PIE11 PIE11
PIE11                                    equ 04A9h
// bitfield definitions
PIE11_CCP3IE_POSN                        equ 0000h
PIE11_CCP3IE_POSITION                    equ 0000h
PIE11_CCP3IE_SIZE                        equ 0001h
PIE11_CCP3IE_LENGTH                      equ 0001h
PIE11_CCP3IE_MASK                        equ 0001h
PIE11_CLC6IE_POSN                        equ 0001h
PIE11_CLC6IE_POSITION                    equ 0001h
PIE11_CLC6IE_SIZE                        equ 0001h
PIE11_CLC6IE_LENGTH                      equ 0001h
PIE11_CLC6IE_MASK                        equ 0002h
PIE11_CWG3IE_POSN                        equ 0002h
PIE11_CWG3IE_POSITION                    equ 0002h
PIE11_CWG3IE_SIZE                        equ 0001h
PIE11_CWG3IE_LENGTH                      equ 0001h
PIE11_CWG3IE_MASK                        equ 0004h
PIE11_TMR4IE_POSN                        equ 0003h
PIE11_TMR4IE_POSITION                    equ 0003h
PIE11_TMR4IE_SIZE                        equ 0001h
PIE11_TMR4IE_LENGTH                      equ 0001h
PIE11_TMR4IE_MASK                        equ 0008h
PIE11_DMA4SCNTIE_POSN                    equ 0004h
PIE11_DMA4SCNTIE_POSITION                equ 0004h
PIE11_DMA4SCNTIE_SIZE                    equ 0001h
PIE11_DMA4SCNTIE_LENGTH                  equ 0001h
PIE11_DMA4SCNTIE_MASK                    equ 0010h
PIE11_DMA4DCNTIE_POSN                    equ 0005h
PIE11_DMA4DCNTIE_POSITION                equ 0005h
PIE11_DMA4DCNTIE_SIZE                    equ 0001h
PIE11_DMA4DCNTIE_LENGTH                  equ 0001h
PIE11_DMA4DCNTIE_MASK                    equ 0020h
PIE11_DMA4ORIE_POSN                      equ 0006h
PIE11_DMA4ORIE_POSITION                  equ 0006h
PIE11_DMA4ORIE_SIZE                      equ 0001h
PIE11_DMA4ORIE_LENGTH                    equ 0001h
PIE11_DMA4ORIE_MASK                      equ 0040h
PIE11_DMA4AIE_POSN                       equ 0007h
PIE11_DMA4AIE_POSITION                   equ 0007h
PIE11_DMA4AIE_SIZE                       equ 0001h
PIE11_DMA4AIE_LENGTH                     equ 0001h
PIE11_DMA4AIE_MASK                       equ 0080h

// Register: PIE12
#define PIE12 PIE12
PIE12                                    equ 04AAh
// bitfield definitions
PIE12_U4RXIE_POSN                        equ 0000h
PIE12_U4RXIE_POSITION                    equ 0000h
PIE12_U4RXIE_SIZE                        equ 0001h
PIE12_U4RXIE_LENGTH                      equ 0001h
PIE12_U4RXIE_MASK                        equ 0001h
PIE12_U4TXIE_POSN                        equ 0001h
PIE12_U4TXIE_POSITION                    equ 0001h
PIE12_U4TXIE_SIZE                        equ 0001h
PIE12_U4TXIE_LENGTH                      equ 0001h
PIE12_U4TXIE_MASK                        equ 0002h
PIE12_U4EIE_POSN                         equ 0002h
PIE12_U4EIE_POSITION                     equ 0002h
PIE12_U4EIE_SIZE                         equ 0001h
PIE12_U4EIE_LENGTH                       equ 0001h
PIE12_U4EIE_MASK                         equ 0004h
PIE12_U4IE_POSN                          equ 0003h
PIE12_U4IE_POSITION                      equ 0003h
PIE12_U4IE_SIZE                          equ 0001h
PIE12_U4IE_LENGTH                        equ 0001h
PIE12_U4IE_MASK                          equ 0008h
PIE12_DMA5SCNTIE_POSN                    equ 0004h
PIE12_DMA5SCNTIE_POSITION                equ 0004h
PIE12_DMA5SCNTIE_SIZE                    equ 0001h
PIE12_DMA5SCNTIE_LENGTH                  equ 0001h
PIE12_DMA5SCNTIE_MASK                    equ 0010h
PIE12_DMA5DCNTIE_POSN                    equ 0005h
PIE12_DMA5DCNTIE_POSITION                equ 0005h
PIE12_DMA5DCNTIE_SIZE                    equ 0001h
PIE12_DMA5DCNTIE_LENGTH                  equ 0001h
PIE12_DMA5DCNTIE_MASK                    equ 0020h
PIE12_DMA5ORIE_POSN                      equ 0006h
PIE12_DMA5ORIE_POSITION                  equ 0006h
PIE12_DMA5ORIE_SIZE                      equ 0001h
PIE12_DMA5ORIE_LENGTH                    equ 0001h
PIE12_DMA5ORIE_MASK                      equ 0040h
PIE12_DMA5AIE_POSN                       equ 0007h
PIE12_DMA5AIE_POSITION                   equ 0007h
PIE12_DMA5AIE_SIZE                       equ 0001h
PIE12_DMA5AIE_LENGTH                     equ 0001h
PIE12_DMA5AIE_MASK                       equ 0080h

// Register: PIE13
#define PIE13 PIE13
PIE13                                    equ 04ABh
// bitfield definitions
PIE13_U5RXIE_POSN                        equ 0000h
PIE13_U5RXIE_POSITION                    equ 0000h
PIE13_U5RXIE_SIZE                        equ 0001h
PIE13_U5RXIE_LENGTH                      equ 0001h
PIE13_U5RXIE_MASK                        equ 0001h
PIE13_U5TXIE_POSN                        equ 0001h
PIE13_U5TXIE_POSITION                    equ 0001h
PIE13_U5TXIE_SIZE                        equ 0001h
PIE13_U5TXIE_LENGTH                      equ 0001h
PIE13_U5TXIE_MASK                        equ 0002h
PIE13_U5EIE_POSN                         equ 0002h
PIE13_U5EIE_POSITION                     equ 0002h
PIE13_U5EIE_SIZE                         equ 0001h
PIE13_U5EIE_LENGTH                       equ 0001h
PIE13_U5EIE_MASK                         equ 0004h
PIE13_U5IE_POSN                          equ 0003h
PIE13_U5IE_POSITION                      equ 0003h
PIE13_U5IE_SIZE                          equ 0001h
PIE13_U5IE_LENGTH                        equ 0001h
PIE13_U5IE_MASK                          equ 0008h
PIE13_DMA6SCNTIE_POSN                    equ 0004h
PIE13_DMA6SCNTIE_POSITION                equ 0004h
PIE13_DMA6SCNTIE_SIZE                    equ 0001h
PIE13_DMA6SCNTIE_LENGTH                  equ 0001h
PIE13_DMA6SCNTIE_MASK                    equ 0010h
PIE13_DMA6DCNTIE_POSN                    equ 0005h
PIE13_DMA6DCNTIE_POSITION                equ 0005h
PIE13_DMA6DCNTIE_SIZE                    equ 0001h
PIE13_DMA6DCNTIE_LENGTH                  equ 0001h
PIE13_DMA6DCNTIE_MASK                    equ 0020h
PIE13_DMA6ORIE_POSN                      equ 0006h
PIE13_DMA6ORIE_POSITION                  equ 0006h
PIE13_DMA6ORIE_SIZE                      equ 0001h
PIE13_DMA6ORIE_LENGTH                    equ 0001h
PIE13_DMA6ORIE_MASK                      equ 0040h
PIE13_DMA6AIE_POSN                       equ 0007h
PIE13_DMA6AIE_POSITION                   equ 0007h
PIE13_DMA6AIE_SIZE                       equ 0001h
PIE13_DMA6AIE_LENGTH                     equ 0001h
PIE13_DMA6AIE_MASK                       equ 0080h

// Register: PIE14
#define PIE14 PIE14
PIE14                                    equ 04ACh
// bitfield definitions
PIE14_CLC7IE_POSN                        equ 0001h
PIE14_CLC7IE_POSITION                    equ 0001h
PIE14_CLC7IE_SIZE                        equ 0001h
PIE14_CLC7IE_LENGTH                      equ 0001h
PIE14_CLC7IE_MASK                        equ 0002h
PIE14_C2IE_POSN                          equ 0002h
PIE14_C2IE_POSITION                      equ 0002h
PIE14_C2IE_SIZE                          equ 0001h
PIE14_C2IE_LENGTH                        equ 0001h
PIE14_C2IE_MASK                          equ 0004h
PIE14_NCO3IE_POSN                        equ 0003h
PIE14_NCO3IE_POSITION                    equ 0003h
PIE14_NCO3IE_SIZE                        equ 0001h
PIE14_NCO3IE_LENGTH                      equ 0001h
PIE14_NCO3IE_MASK                        equ 0008h

// Register: PIE15
#define PIE15 PIE15
PIE15                                    equ 04ADh
// bitfield definitions
PIE15_NVMIE_POSN                         equ 0000h
PIE15_NVMIE_POSITION                     equ 0000h
PIE15_NVMIE_SIZE                         equ 0001h
PIE15_NVMIE_LENGTH                       equ 0001h
PIE15_NVMIE_MASK                         equ 0001h
PIE15_CLC8IE_POSN                        equ 0001h
PIE15_CLC8IE_POSITION                    equ 0001h
PIE15_CLC8IE_SIZE                        equ 0001h
PIE15_CLC8IE_LENGTH                      equ 0001h
PIE15_CLC8IE_MASK                        equ 0002h
PIE15_CRCIE_POSN                         equ 0002h
PIE15_CRCIE_POSITION                     equ 0002h
PIE15_CRCIE_SIZE                         equ 0001h
PIE15_CRCIE_LENGTH                       equ 0001h
PIE15_CRCIE_MASK                         equ 0004h
PIE15_TMR6IE_POSN                        equ 0003h
PIE15_TMR6IE_POSITION                    equ 0003h
PIE15_TMR6IE_SIZE                        equ 0001h
PIE15_TMR6IE_LENGTH                      equ 0001h
PIE15_TMR6IE_MASK                        equ 0008h

// Register: PIR0
#define PIR0 PIR0
PIR0                                     equ 04AEh
// bitfield definitions
PIR0_SWIF_POSN                           equ 0000h
PIR0_SWIF_POSITION                       equ 0000h
PIR0_SWIF_SIZE                           equ 0001h
PIR0_SWIF_LENGTH                         equ 0001h
PIR0_SWIF_MASK                           equ 0001h
PIR0_HLVDIF_POSN                         equ 0001h
PIR0_HLVDIF_POSITION                     equ 0001h
PIR0_HLVDIF_SIZE                         equ 0001h
PIR0_HLVDIF_LENGTH                       equ 0001h
PIR0_HLVDIF_MASK                         equ 0002h
PIR0_OSFIF_POSN                          equ 0002h
PIR0_OSFIF_POSITION                      equ 0002h
PIR0_OSFIF_SIZE                          equ 0001h
PIR0_OSFIF_LENGTH                        equ 0001h
PIR0_OSFIF_MASK                          equ 0004h
PIR0_CSWIF_POSN                          equ 0003h
PIR0_CSWIF_POSITION                      equ 0003h
PIR0_CSWIF_SIZE                          equ 0001h
PIR0_CSWIF_LENGTH                        equ 0001h
PIR0_CSWIF_MASK                          equ 0008h
PIR0_CLC1IF_POSN                         equ 0005h
PIR0_CLC1IF_POSITION                     equ 0005h
PIR0_CLC1IF_SIZE                         equ 0001h
PIR0_CLC1IF_LENGTH                       equ 0001h
PIR0_CLC1IF_MASK                         equ 0020h
PIR0_IOCIF_POSN                          equ 0007h
PIR0_IOCIF_POSITION                      equ 0007h
PIR0_IOCIF_SIZE                          equ 0001h
PIR0_IOCIF_LENGTH                        equ 0001h
PIR0_IOCIF_MASK                          equ 0080h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 04AFh
// bitfield definitions
PIR1_INT0IF_POSN                         equ 0000h
PIR1_INT0IF_POSITION                     equ 0000h
PIR1_INT0IF_SIZE                         equ 0001h
PIR1_INT0IF_LENGTH                       equ 0001h
PIR1_INT0IF_MASK                         equ 0001h
PIR1_ZCDIF_POSN                          equ 0001h
PIR1_ZCDIF_POSITION                      equ 0001h
PIR1_ZCDIF_SIZE                          equ 0001h
PIR1_ZCDIF_LENGTH                        equ 0001h
PIR1_ZCDIF_MASK                          equ 0002h
PIR1_ADIF_POSN                           equ 0002h
PIR1_ADIF_POSITION                       equ 0002h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0004h
PIR1_ACTIF_POSN                          equ 0003h
PIR1_ACTIF_POSITION                      equ 0003h
PIR1_ACTIF_SIZE                          equ 0001h
PIR1_ACTIF_LENGTH                        equ 0001h
PIR1_ACTIF_MASK                          equ 0008h
PIR1_C1IF_POSN                           equ 0004h
PIR1_C1IF_POSITION                       equ 0004h
PIR1_C1IF_SIZE                           equ 0001h
PIR1_C1IF_LENGTH                         equ 0001h
PIR1_C1IF_MASK                           equ 0010h
PIR1_SMT1IF_POSN                         equ 0005h
PIR1_SMT1IF_POSITION                     equ 0005h
PIR1_SMT1IF_SIZE                         equ 0001h
PIR1_SMT1IF_LENGTH                       equ 0001h
PIR1_SMT1IF_MASK                         equ 0020h
PIR1_SMT1PRAIF_POSN                      equ 0006h
PIR1_SMT1PRAIF_POSITION                  equ 0006h
PIR1_SMT1PRAIF_SIZE                      equ 0001h
PIR1_SMT1PRAIF_LENGTH                    equ 0001h
PIR1_SMT1PRAIF_MASK                      equ 0040h
PIR1_SMT1PWAIF_POSN                      equ 0007h
PIR1_SMT1PWAIF_POSITION                  equ 0007h
PIR1_SMT1PWAIF_SIZE                      equ 0001h
PIR1_SMT1PWAIF_LENGTH                    equ 0001h
PIR1_SMT1PWAIF_MASK                      equ 0080h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 04B0h
// bitfield definitions
PIR2_ADTIF_POSN                          equ 0000h
PIR2_ADTIF_POSITION                      equ 0000h
PIR2_ADTIF_SIZE                          equ 0001h
PIR2_ADTIF_LENGTH                        equ 0001h
PIR2_ADTIF_MASK                          equ 0001h
PIR2_DMA1SCNTIF_POSN                     equ 0004h
PIR2_DMA1SCNTIF_POSITION                 equ 0004h
PIR2_DMA1SCNTIF_SIZE                     equ 0001h
PIR2_DMA1SCNTIF_LENGTH                   equ 0001h
PIR2_DMA1SCNTIF_MASK                     equ 0010h
PIR2_DMA1DCNTIF_POSN                     equ 0005h
PIR2_DMA1DCNTIF_POSITION                 equ 0005h
PIR2_DMA1DCNTIF_SIZE                     equ 0001h
PIR2_DMA1DCNTIF_LENGTH                   equ 0001h
PIR2_DMA1DCNTIF_MASK                     equ 0020h
PIR2_DMA1ORIF_POSN                       equ 0006h
PIR2_DMA1ORIF_POSITION                   equ 0006h
PIR2_DMA1ORIF_SIZE                       equ 0001h
PIR2_DMA1ORIF_LENGTH                     equ 0001h
PIR2_DMA1ORIF_MASK                       equ 0040h
PIR2_DMA1AIF_POSN                        equ 0007h
PIR2_DMA1AIF_POSITION                    equ 0007h
PIR2_DMA1AIF_SIZE                        equ 0001h
PIR2_DMA1AIF_LENGTH                      equ 0001h
PIR2_DMA1AIF_MASK                        equ 0080h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 04B1h
// bitfield definitions
PIR3_SPI1RXIF_POSN                       equ 0000h
PIR3_SPI1RXIF_POSITION                   equ 0000h
PIR3_SPI1RXIF_SIZE                       equ 0001h
PIR3_SPI1RXIF_LENGTH                     equ 0001h
PIR3_SPI1RXIF_MASK                       equ 0001h
PIR3_SPI1TXIF_POSN                       equ 0001h
PIR3_SPI1TXIF_POSITION                   equ 0001h
PIR3_SPI1TXIF_SIZE                       equ 0001h
PIR3_SPI1TXIF_LENGTH                     equ 0001h
PIR3_SPI1TXIF_MASK                       equ 0002h
PIR3_SPI1IF_POSN                         equ 0002h
PIR3_SPI1IF_POSITION                     equ 0002h
PIR3_SPI1IF_SIZE                         equ 0001h
PIR3_SPI1IF_LENGTH                       equ 0001h
PIR3_SPI1IF_MASK                         equ 0004h
PIR3_TMR2IF_POSN                         equ 0003h
PIR3_TMR2IF_POSITION                     equ 0003h
PIR3_TMR2IF_SIZE                         equ 0001h
PIR3_TMR2IF_LENGTH                       equ 0001h
PIR3_TMR2IF_MASK                         equ 0008h
PIR3_TMR1IF_POSN                         equ 0004h
PIR3_TMR1IF_POSITION                     equ 0004h
PIR3_TMR1IF_SIZE                         equ 0001h
PIR3_TMR1IF_LENGTH                       equ 0001h
PIR3_TMR1IF_MASK                         equ 0010h
PIR3_TMR1GIF_POSN                        equ 0005h
PIR3_TMR1GIF_POSITION                    equ 0005h
PIR3_TMR1GIF_SIZE                        equ 0001h
PIR3_TMR1GIF_LENGTH                      equ 0001h
PIR3_TMR1GIF_MASK                        equ 0020h
PIR3_CCP1IF_POSN                         equ 0006h
PIR3_CCP1IF_POSITION                     equ 0006h
PIR3_CCP1IF_SIZE                         equ 0001h
PIR3_CCP1IF_LENGTH                       equ 0001h
PIR3_CCP1IF_MASK                         equ 0040h
PIR3_TMR0IF_POSN                         equ 0007h
PIR3_TMR0IF_POSITION                     equ 0007h
PIR3_TMR0IF_SIZE                         equ 0001h
PIR3_TMR0IF_LENGTH                       equ 0001h
PIR3_TMR0IF_MASK                         equ 0080h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 04B2h
// bitfield definitions
PIR4_U1RXIF_POSN                         equ 0000h
PIR4_U1RXIF_POSITION                     equ 0000h
PIR4_U1RXIF_SIZE                         equ 0001h
PIR4_U1RXIF_LENGTH                       equ 0001h
PIR4_U1RXIF_MASK                         equ 0001h
PIR4_U1TXIF_POSN                         equ 0001h
PIR4_U1TXIF_POSITION                     equ 0001h
PIR4_U1TXIF_SIZE                         equ 0001h
PIR4_U1TXIF_LENGTH                       equ 0001h
PIR4_U1TXIF_MASK                         equ 0002h
PIR4_U1EIF_POSN                          equ 0002h
PIR4_U1EIF_POSITION                      equ 0002h
PIR4_U1EIF_SIZE                          equ 0001h
PIR4_U1EIF_LENGTH                        equ 0001h
PIR4_U1EIF_MASK                          equ 0004h
PIR4_U1IF_POSN                           equ 0003h
PIR4_U1IF_POSITION                       equ 0003h
PIR4_U1IF_SIZE                           equ 0001h
PIR4_U1IF_LENGTH                         equ 0001h
PIR4_U1IF_MASK                           equ 0008h
PIR4_PWM1PIF_POSN                        equ 0006h
PIR4_PWM1PIF_POSITION                    equ 0006h
PIR4_PWM1PIF_SIZE                        equ 0001h
PIR4_PWM1PIF_LENGTH                      equ 0001h
PIR4_PWM1PIF_MASK                        equ 0040h
PIR4_PWM1IF_POSN                         equ 0007h
PIR4_PWM1IF_POSITION                     equ 0007h
PIR4_PWM1IF_SIZE                         equ 0001h
PIR4_PWM1IF_LENGTH                       equ 0001h
PIR4_PWM1IF_MASK                         equ 0080h

