GopalSaraf/Practicals/PSDL/include/proc/pic18f27q43.inc
#define CWG2LSBD0                        BANKMASK(CWG2AS0), 4, b
#define CWG2LSBD1                        BANKMASK(CWG2AS0), 5, b
#define CWG2LSDB0                        BANKMASK(CWG2AS0), 4, b
#define CWG2LSDB1                        BANKMASK(CWG2AS0), 5, b
#define CWG2MD                           BANKMASK(PMD4), 5, b
#define CWG2MODE0                        BANKMASK(CWG2CON0), 0, b
#define CWG2MODE1                        BANKMASK(CWG2CON0), 1, b
#define CWG2MODE2                        BANKMASK(CWG2CON0), 2, b
#define CWG2OVRA                         BANKMASK(CWG2STR), 4, b
#define CWG2OVRB                         BANKMASK(CWG2STR), 5, b
#define CWG2OVRC                         BANKMASK(CWG2STR), 6, b
#define CWG2OVRD                         BANKMASK(CWG2STR), 7, b
#define CWG2POLA                         BANKMASK(CWG2CON1), 0, b
#define CWG2POLB                         BANKMASK(CWG2CON1), 1, b
#define CWG2POLC                         BANKMASK(CWG2CON1), 2, b
#define CWG2POLD                         BANKMASK(CWG2CON1), 3, b
#define CWG2STRA                         BANKMASK(CWG2STR), 0, b
#define CWG2STRB                         BANKMASK(CWG2STR), 1, b
#define CWG2STRC                         BANKMASK(CWG2STR), 2, b
#define CWG2STRD                         BANKMASK(CWG2STR), 3, b
#define CWG3CS                           BANKMASK(CWG3CLK), 0, b
#define CWG3DBF0                         BANKMASK(CWG3DBF), 0, b
#define CWG3DBF1                         BANKMASK(CWG3DBF), 1, b
#define CWG3DBF2                         BANKMASK(CWG3DBF), 2, b
#define CWG3DBF3                         BANKMASK(CWG3DBF), 3, b
#define CWG3DBF4                         BANKMASK(CWG3DBF), 4, b
#define CWG3DBF5                         BANKMASK(CWG3DBF), 5, b
#define CWG3DBR0                         BANKMASK(CWG3DBR), 0, b
#define CWG3DBR1                         BANKMASK(CWG3DBR), 1, b
#define CWG3DBR2                         BANKMASK(CWG3DBR), 2, b
#define CWG3DBR3                         BANKMASK(CWG3DBR), 3, b
#define CWG3DBR4                         BANKMASK(CWG3DBR), 4, b
#define CWG3DBR5                         BANKMASK(CWG3DBR), 5, b
#define CWG3EN                           BANKMASK(CWG3CON0), 7, b
#define CWG3IE                           BANKMASK(PIE11), 2, a
#define CWG3IF                           BANKMASK(PIR11), 2, a
#define CWG3IN                           BANKMASK(CWG3CON1), 5, b
#define CWG3INPPS0                       BANKMASK(CWG3PPS), 0, b
#define CWG3INPPS1                       BANKMASK(CWG3PPS), 1, b
#define CWG3INPPS2                       BANKMASK(CWG3PPS), 2, b
#define CWG3INPPS3                       BANKMASK(CWG3PPS), 3, b
#define CWG3INPPS4                       BANKMASK(CWG3PPS), 4, b
#define CWG3IP                           BANKMASK(IPR11), 2, b
#define CWG3LD                           BANKMASK(CWG3CON0), 6, b
#define CWG3LSAC0                        BANKMASK(CWG3AS0), 2, b
#define CWG3LSAC1                        BANKMASK(CWG3AS0), 3, b
#define CWG3LSBD0                        BANKMASK(CWG3AS0), 4, b
#define CWG3LSBD1                        BANKMASK(CWG3AS0), 5, b
#define CWG3LSDB0                        BANKMASK(CWG3AS0), 4, b
#define CWG3LSDB1                        BANKMASK(CWG3AS0), 5, b
#define CWG3MD                           BANKMASK(PMD4), 6, b
#define CWG3MODE0                        BANKMASK(CWG3CON0), 0, b
#define CWG3MODE1                        BANKMASK(CWG3CON0), 1, b
#define CWG3MODE2                        BANKMASK(CWG3CON0), 2, b
#define CWG3OVRA                         BANKMASK(CWG3STR), 4, b
#define CWG3OVRB                         BANKMASK(CWG3STR), 5, b
#define CWG3OVRC                         BANKMASK(CWG3STR), 6, b
#define CWG3OVRD                         BANKMASK(CWG3STR), 7, b
#define CWG3POLA                         BANKMASK(CWG3CON1), 0, b
#define CWG3POLB                         BANKMASK(CWG3CON1), 1, b
#define CWG3POLC                         BANKMASK(CWG3CON1), 2, b
#define CWG3POLD                         BANKMASK(CWG3CON1), 3, b
#define CWG3STRA                         BANKMASK(CWG3STR), 0, b
#define CWG3STRB                         BANKMASK(CWG3STR), 1, b
#define CWG3STRC                         BANKMASK(CWG3STR), 2, b
#define CWG3STRD                         BANKMASK(CWG3STR), 3, b
#define D1S0                             BANKMASK(CLCnSEL0), 0, b
#define D1S1                             BANKMASK(CLCnSEL0), 1, b
#define D1S2                             BANKMASK(CLCnSEL0), 2, b
#define D1S3                             BANKMASK(CLCnSEL0), 3, b
#define D1S4                             BANKMASK(CLCnSEL0), 4, b
#define D1S5                             BANKMASK(CLCnSEL0), 5, b
#define D1S6                             BANKMASK(CLCnSEL0), 6, b
#define D1S7                             BANKMASK(CLCnSEL0), 7, b
#define D2S0                             BANKMASK(CLCnSEL1), 0, b
#define D2S1                             BANKMASK(CLCnSEL1), 1, b
#define D2S2                             BANKMASK(CLCnSEL1), 2, b
#define D2S3                             BANKMASK(CLCnSEL1), 3, b
#define D2S4                             BANKMASK(CLCnSEL1), 4, b
#define D2S5                             BANKMASK(CLCnSEL1), 5, b
#define D2S6                             BANKMASK(CLCnSEL1), 6, b
#define D2S7                             BANKMASK(CLCnSEL1), 7, b
#define D3S0                             BANKMASK(CLCnSEL2), 0, b
#define D3S1                             BANKMASK(CLCnSEL2), 1, b
#define D3S2                             BANKMASK(CLCnSEL2), 2, b
#define D3S3                             BANKMASK(CLCnSEL2), 3, b
#define D3S4                             BANKMASK(CLCnSEL2), 4, b
#define D3S5                             BANKMASK(CLCnSEL2), 5, b
#define D3S6                             BANKMASK(CLCnSEL2), 6, b
#define D3S7                             BANKMASK(CLCnSEL2), 7, b
#define D4S0                             BANKMASK(CLCnSEL3), 0, b
#define D4S1                             BANKMASK(CLCnSEL3), 1, b
#define D4S2                             BANKMASK(CLCnSEL3), 2, b
#define D4S3                             BANKMASK(CLCnSEL3), 3, b
#define D4S4                             BANKMASK(CLCnSEL3), 4, b
#define D4S5                             BANKMASK(CLCnSEL3), 5, b
#define D4S6                             BANKMASK(CLCnSEL3), 6, b
#define D4S7                             BANKMASK(CLCnSEL3), 7, b
#define DAC1EN                           BANKMASK(DAC1CON), 7, b
#define DAC1MD                           BANKMASK(PMD3), 6, b
#define DAC1PSS0                         BANKMASK(DAC1CON), 2, b
#define DAC1PSS1                         BANKMASK(DAC1CON), 3, b
#define DAC1R0                           BANKMASK(DAC1DATL), 0, b
#define DAC1R1                           BANKMASK(DAC1DATL), 1, b
#define DAC1R2                           BANKMASK(DAC1DATL), 2, b
#define DAC1R3                           BANKMASK(DAC1DATL), 3, b
#define DAC1R4                           BANKMASK(DAC1DATL), 4, b
#define DAC1R5                           BANKMASK(DAC1DATL), 5, b
#define DAC1R6                           BANKMASK(DAC1DATL), 6, b
#define DAC1R7                           BANKMASK(DAC1DATL), 7, b
#define DATA                             BANKMASK(I2C1STAT0), 3, b
#define DATA0                            BANKMASK(CRCDATL), 0, b
#define DATA1                            BANKMASK(CRCDATL), 1, b
#define DATA10                           BANKMASK(CRCDATH), 2, b
#define DATA11                           BANKMASK(CRCDATH), 3, b
#define DATA12                           BANKMASK(CRCDATH), 4, b
#define DATA13                           BANKMASK(CRCDATH), 5, b
#define DATA14                           BANKMASK(CRCDATH), 6, b
#define DATA15                           BANKMASK(CRCDATH), 7, b
#define DATA2                            BANKMASK(CRCDATL), 2, b
#define DATA3                            BANKMASK(CRCDATL), 3, b
#define DATA4                            BANKMASK(CRCDATL), 4, b
#define DATA5                            BANKMASK(CRCDATL), 5, b
#define DATA6                            BANKMASK(CRCDATL), 6, b
#define DATA7                            BANKMASK(CRCDATL), 7, b
#define DATA8                            BANKMASK(CRCDATH), 0, b
#define DATA9                            BANKMASK(CRCDATH), 1, b
#define DC0                              BANKMASK(CLKRCON), 3, b
#define DC1                              BANKMASK(CLKRCON), 4, b
#define DCNT0                            BANKMASK(DMAnDCNTL), 0, b
#define DCNT1                            BANKMASK(DMAnDCNTL), 1, b
#define DCNT10                           BANKMASK(DMAnDCNTH), 2, b
#define DCNT11                           BANKMASK(DMAnDCNTH), 3, b
#define DCNT2                            BANKMASK(DMAnDCNTL), 2, b
#define DCNT3                            BANKMASK(DMAnDCNTL), 3, b
#define DCNT4                            BANKMASK(DMAnDCNTL), 4, b
#define DCNT5                            BANKMASK(DMAnDCNTL), 5, b
#define DCNT6                            BANKMASK(DMAnDCNTL), 6, b
#define DCNT7                            BANKMASK(DMAnDCNTL), 7, b
#define DCNT8                            BANKMASK(DMAnDCNTH), 0, b
#define DCNT9                            BANKMASK(DMAnDCNTH), 1, b
#define DGO                              BANKMASK(DMAnCON0), 5, b
#define DIV0                             BANKMASK(CLKRCON), 0, b
#define DIV1                             BANKMASK(CLKRCON), 1, b
#define DIV2                             BANKMASK(CLKRCON), 2, b
#define DLEN0                            BANKMASK(CRCCON1), 4, b
#define DLEN1                            BANKMASK(CRCCON1), 5, b
#define DLEN2                            BANKMASK(CRCCON1), 6, b
#define DLEN3                            BANKMASK(CRCCON1), 7, b
#define DMA1AIE                          BANKMASK(PIE2), 7, a
#define DMA1AIF                          BANKMASK(PIR2), 7, a
#define DMA1AIP                          BANKMASK(IPR2), 7, b
#define DMA1DCNTIE                       BANKMASK(PIE2), 5, a
#define DMA1DCNTIF                       BANKMASK(PIR2), 5, a
#define DMA1DCNTIP                       BANKMASK(IPR2), 5, b
#define DMA1MD                           BANKMASK(PMD8), 0, b
#define DMA1ORIE                         BANKMASK(PIE2), 6, a
#define DMA1ORIF                         BANKMASK(PIR2), 6, a
#define DMA1ORIP                         BANKMASK(IPR2), 6, b
#define DMA1PR0                          BANKMASK(DMA1PR), 0, b
#define DMA1PR1                          BANKMASK(DMA1PR), 1, b
#define DMA1PR2                          BANKMASK(DMA1PR), 2, b
#define DMA1SCNTIE                       BANKMASK(PIE2), 4, a
#define DMA1SCNTIF                       BANKMASK(PIR2), 4, a
#define DMA1SCNTIP                       BANKMASK(IPR2), 4, b
#define DMA2AIE                          BANKMASK(PIE6), 7, a
#define DMA2AIF                          BANKMASK(PIR6), 7, a
#define DMA2AIP                          BANKMASK(IPR6), 7, b
#define DMA2DCNTIE                       BANKMASK(PIE6), 5, a
#define DMA2DCNTIF                       BANKMASK(PIR6), 5, a
#define DMA2DCNTIP                       BANKMASK(IPR6), 5, b
#define DMA2MD                           BANKMASK(PMD8), 1, b
#define DMA2ORIE                         BANKMASK(PIE6), 6, a
#define DMA2ORIF                         BANKMASK(PIR6), 6, a
#define DMA2ORIP                         BANKMASK(IPR6), 6, b
#define DMA2PR0                          BANKMASK(DMA2PR), 0, b
#define DMA2PR1                          BANKMASK(DMA2PR), 1, b
#define DMA2PR2                          BANKMASK(DMA2PR), 2, b
#define DMA2SCNTIE                       BANKMASK(PIE6), 4, a
#define DMA2SCNTIF                       BANKMASK(PIR6), 4, a
#define DMA2SCNTIP                       BANKMASK(IPR6), 4, b
#define DMA3AIE                          BANKMASK(PIE10), 7, a
#define DMA3AIF                          BANKMASK(PIR10), 7, a
#define DMA3AIP                          BANKMASK(IPR10), 7, b
#define DMA3DCNTIE                       BANKMASK(PIE10), 5, a
#define DMA3DCNTIF                       BANKMASK(PIR10), 5, a
#define DMA3DCNTIP                       BANKMASK(IPR10), 5, b
#define DMA3MD                           BANKMASK(PMD8), 2, b
#define DMA3ORIE                         BANKMASK(PIE10), 6, a
#define DMA3ORIF                         BANKMASK(PIR10), 6, a
#define DMA3ORIP                         BANKMASK(IPR10), 6, b
#define DMA3PR0                          BANKMASK(DMA3PR), 0, b
#define DMA3PR1                          BANKMASK(DMA3PR), 1, b
#define DMA3PR2                          BANKMASK(DMA3PR), 2, b
#define DMA3SCNTIE                       BANKMASK(PIE10), 4, a
#define DMA3SCNTIF                       BANKMASK(PIR10), 4, a
#define DMA3SCNTIP                       BANKMASK(IPR10), 4, b
#define DMA4AIE                          BANKMASK(PIE11), 7, a
#define DMA4AIF                          BANKMASK(PIR11), 7, a
#define DMA4AIP                          BANKMASK(IPR11), 7, b
#define DMA4DCNTIE                       BANKMASK(PIE11), 5, a
#define DMA4DCNTIF                       BANKMASK(PIR11), 5, a
#define DMA4DCNTIP                       BANKMASK(IPR11), 5, b
#define DMA4MD                           BANKMASK(PMD8), 3, b
#define DMA4ORIE                         BANKMASK(PIE11), 6, a
#define DMA4ORIF                         BANKMASK(PIR11), 6, a
#define DMA4ORIP                         BANKMASK(IPR11), 6, b
#define DMA4PR0                          BANKMASK(DMA4PR), 0, b
#define DMA4PR1                          BANKMASK(DMA4PR), 1, b
#define DMA4PR2                          BANKMASK(DMA4PR), 2, b
#define DMA4SCNTIE                       BANKMASK(PIE11), 4, a
#define DMA4SCNTIF                       BANKMASK(PIR11), 4, a
#define DMA4SCNTIP                       BANKMASK(IPR11), 4, b
#define DMA5AIE                          BANKMASK(PIE12), 7, a
#define DMA5AIF                          BANKMASK(PIR12), 7, a
#define DMA5AIP                          BANKMASK(IPR12), 7, b
#define DMA5DCNTIE                       BANKMASK(PIE12), 5, a
#define DMA5DCNTIF                       BANKMASK(PIR12), 5, a
#define DMA5DCNTIP                       BANKMASK(IPR12), 5, b
#define DMA5MD                           BANKMASK(PMD8), 4, b
#define DMA5ORIE                         BANKMASK(PIE12), 6, a
#define DMA5ORIF                         BANKMASK(PIR12), 6, a
#define DMA5ORIP                         BANKMASK(IPR12), 6, b
#define DMA5PR0                          BANKMASK(DMA5PR), 0, b
#define DMA5PR1                          BANKMASK(DMA5PR), 1, b
#define DMA5PR2                          BANKMASK(DMA5PR), 2, b
#define DMA5SCNTIE                       BANKMASK(PIE12), 4, a
#define DMA5SCNTIF                       BANKMASK(PIR12), 4, a
#define DMA5SCNTIP                       BANKMASK(IPR12), 4, b
#define DMA6AIE                          BANKMASK(PIE13), 7, a
#define DMA6AIF                          BANKMASK(PIR13), 7, a
#define DMA6AIP                          BANKMASK(IPR13), 7, b
#define DMA6DCNTIE                       BANKMASK(PIE13), 5, a
#define DMA6DCNTIF                       BANKMASK(PIR13), 5, a
#define DMA6DCNTIP                       BANKMASK(IPR13), 5, b
#define DMA6MD                           BANKMASK(PMD8), 5, b
#define DMA6ORIE                         BANKMASK(PIE13), 6, a
#define DMA6ORIF                         BANKMASK(PIR13), 6, a
#define DMA6ORIP                         BANKMASK(IPR13), 6, b
#define DMA6PR0                          BANKMASK(DMA6PR), 0, b
#define DMA6PR1                          BANKMASK(DMA6PR), 1, b
#define DMA6PR2                          BANKMASK(DMA6PR), 2, b
#define DMA6SCNTIE                       BANKMASK(PIE13), 4, a
#define DMA6SCNTIF                       BANKMASK(PIR13), 4, a
#define DMA6SCNTIP                       BANKMASK(IPR13), 4, b
#define DOE                              BANKMASK(CPUDOZE), 4, a
#define DONE                             BANKMASK(ADCON0), 0, b
#define DOZE0                            BANKMASK(CPUDOZE), 0, a
#define DOZE1                            BANKMASK(CPUDOZE), 1, a
#define DOZE2                            BANKMASK(CPUDOZE), 2, a
#define DOZEN                            BANKMASK(CPUDOZE), 6, a
#define DPTR0                            BANKMASK(DMAnDPTRL), 0, b
#define DPTR1                            BANKMASK(DMAnDPTRL), 1, b
#define DPTR10                           BANKMASK(DMAnDPTRH), 2, b
#define DPTR11                           BANKMASK(DMAnDPTRH), 3, b
#define DPTR12                           BANKMASK(DMAnDPTRH), 4, b
#define DPTR13                           BANKMASK(DMAnDPTRH), 5, b
#define DPTR14                           BANKMASK(DMAnDPTRH), 6, b
#define DPTR15                           BANKMASK(DMAnDPTRH), 7, b
#define DPTR2                            BANKMASK(DMAnDPTRL), 2, b
#define DPTR3                            BANKMASK(DMAnDPTRL), 3, b
#define DPTR4                            BANKMASK(DMAnDPTRL), 4, b
#define DPTR5                            BANKMASK(DMAnDPTRL), 5, b
#define DPTR6                            BANKMASK(DMAnDPTRL), 6, b
#define DPTR7                            BANKMASK(DMAnDPTRL), 7, b
#define DPTR8                            BANKMASK(DMAnDPTRH), 0, b
#define DPTR9                            BANKMASK(DMAnDPTRH), 1, b
#define DSA0                             BANKMASK(DMAnDSAL), 0, b
#define DSA1                             BANKMASK(DMAnDSAL), 1, b
#define DSA10                            BANKMASK(DMAnDSAH), 2, b
#define DSA11                            BANKMASK(DMAnDSAH), 3, b
#define DSA12                            BANKMASK(DMAnDSAH), 4, b
#define DSA13                            BANKMASK(DMAnDSAH), 5, b
#define DSA14                            BANKMASK(DMAnDSAH), 6, b
#define DSA15                            BANKMASK(DMAnDSAH), 7, b
#define DSA2                             BANKMASK(DMAnDSAL), 2, b
#define DSA3                             BANKMASK(DMAnDSAL), 3, b
#define DSA4                             BANKMASK(DMAnDSAL), 4, b
#define DSA5                             BANKMASK(DMAnDSAL), 5, b
#define DSA6                             BANKMASK(DMAnDSAL), 6, b
#define DSA7                             BANKMASK(DMAnDSAL), 7, b
#define DSA8                             BANKMASK(DMAnDSAH), 0, b
#define DSA9                             BANKMASK(DMAnDSAH), 1, b
#define DSEN                             BANKMASK(ADCON1), 0, b
#define DSM1MD                           BANKMASK(PMD4), 3, b
#define DSTP                             BANKMASK(DMAnCON1), 5, b
#define DSZ0                             BANKMASK(DMAnDSZL), 0, b
#define DSZ1                             BANKMASK(DMAnDSZL), 1, b
#define DSZ10                            BANKMASK(DMAnDSZH), 2, b
#define DSZ11                            BANKMASK(DMAnDSZH), 3, b
#define DSZ2                             BANKMASK(DMAnDSZL), 2, b
#define DSZ3                             BANKMASK(DMAnDSZL), 3, b
#define DSZ4                             BANKMASK(DMAnDSZL), 4, b
#define DSZ5                             BANKMASK(DMAnDSZL), 5, b
#define DSZ6                             BANKMASK(DMAnDSZL), 6, b
#define DSZ7                             BANKMASK(DMAnDSZL), 7, b
#define DSZ8                             BANKMASK(DMAnDSZH), 0, b
#define DSZ9                             BANKMASK(DMAnDSZH), 1, b
#define ERR0                             BANKMASK(ADERRL), 0, b
#define ERR1                             BANKMASK(ADERRL), 1, b
#define ERR10                            BANKMASK(ADERRH), 2, b
#define ERR11                            BANKMASK(ADERRH), 3, b
#define ERR12                            BANKMASK(ADERRH), 4, b
#define ERR13                            BANKMASK(ADERRH), 5, b
#define ERR14                            BANKMASK(ADERRH), 6, b
#define ERR15                            BANKMASK(ADERRH), 7, b
#define ERR2                             BANKMASK(ADERRL), 2, b
#define ERR3                             BANKMASK(ADERRL), 3, b
#define ERR4                             BANKMASK(ADERRL), 4, b
#define ERR5                             BANKMASK(ADERRL), 5, b
#define ERR6                             BANKMASK(ADERRL), 6, b
#define ERR7                             BANKMASK(ADERRL), 7, b
#define ERR8                             BANKMASK(ADERRH), 0, b
#define ERR9                             BANKMASK(ADERRH), 1, b
#define EXTOEN                           BANKMASK(OSCEN), 7, b
#define EXTOR                            BANKMASK(OSCSTAT), 7, b
#define FLTR0                            BANKMASK(ADFLTRL), 0, b
#define FLTR1                            BANKMASK(ADFLTRL), 1, b
#define FLTR10                           BANKMASK(ADFLTRH), 2, b
#define FLTR11                           BANKMASK(ADFLTRH), 3, b
#define FLTR12                           BANKMASK(ADFLTRH), 4, b
#define FLTR13                           BANKMASK(ADFLTRH), 5, b
#define FLTR14                           BANKMASK(ADFLTRH), 6, b
#define FLTR15                           BANKMASK(ADFLTRH), 7, b
#define FLTR2                            BANKMASK(ADFLTRL), 2, b
#define FLTR3                            BANKMASK(ADFLTRL), 3, b
#define FLTR4                            BANKMASK(ADFLTRL), 4, b
#define FLTR5                            BANKMASK(ADFLTRL), 5, b
#define FLTR6                            BANKMASK(ADFLTRL), 6, b
#define FLTR7                            BANKMASK(ADFLTRL), 7, b
#define FLTR8                            BANKMASK(ADFLTRH), 0, b
#define FLTR9                            BANKMASK(ADFLTRH), 1, b
#define FM0                              BANKMASK(ADCON0), 2, b
#define FME                              BANKMASK(I2C1CON2), 5, b
#define FRQ0                             BANKMASK(OSCFRQ), 0, b
#define FRQ1                             BANKMASK(OSCFRQ), 1, b
#define FRQ2                             BANKMASK(OSCFRQ), 2, b
#define FRQ3                             BANKMASK(OSCFRQ), 3, b
#define FULL                             BANKMASK(CRCCON0), 0, b
#define FVREN                            BANKMASK(FVRCON), 7, b
#define FVRMD                            BANKMASK(PMD0), 6, b
#define FVRRDY                           BANKMASK(FVRCON), 6, b
#define G1D1N                            BANKMASK(CLCnGLS0), 0, b
#define G1D1T                            BANKMASK(CLCnGLS0), 1, b
#define G1D2N                            BANKMASK(CLCnGLS0), 2, b
#define G1D2T                            BANKMASK(CLCnGLS0), 3, b
#define G1D3N                            BANKMASK(CLCnGLS0), 4, b
#define G1D3T                            BANKMASK(CLCnGLS0), 5, b
#define G1D4N                            BANKMASK(CLCnGLS0), 6, b
#define G1D4T                            BANKMASK(CLCnGLS0), 7, b
#define G1EN                             BANKMASK(CWG1CON0), 7, b
#define G1POL                            BANKMASK(CLCnPOL), 0, b
#define G2D1N                            BANKMASK(CLCnGLS1), 0, b
#define G2D1T                            BANKMASK(CLCnGLS1), 1, b
#define G2D2N                            BANKMASK(CLCnGLS1), 2, b
#define G2D2T                            BANKMASK(CLCnGLS1), 3, b
#define G2D3N                            BANKMASK(CLCnGLS1), 4, b
#define G2D3T                            BANKMASK(CLCnGLS1), 5, b
#define G2D4N                            BANKMASK(CLCnGLS1), 6, b
#define G2D4T                            BANKMASK(CLCnGLS1), 7, b
#define G2EN                             BANKMASK(CWG2CON0), 7, b
#define G2POL                            BANKMASK(CLCnPOL), 1, b
#define G3D1N                            BANKMASK(CLCnGLS2), 0, b
#define G3D1T                            BANKMASK(CLCnGLS2), 1, b
#define G3D2N                            BANKMASK(CLCnGLS2), 2, b
#define G3D2T                            BANKMASK(CLCnGLS2), 3, b
#define G3D3N                            BANKMASK(CLCnGLS2), 4, b
#define G3D3T                            BANKMASK(CLCnGLS2), 5, b
#define G3D4N                            BANKMASK(CLCnGLS2), 6, b
#define G3D4T                            BANKMASK(CLCnGLS2), 7, b
