GopalSaraf/Practicals/PSDL/include/proc/pic18f27q43.inc
#define SSZ2                             BANKMASK(DMAnSSZL), 2, b
#define SSZ3                             BANKMASK(DMAnSSZL), 3, b
#define SSZ4                             BANKMASK(DMAnSSZL), 4, b
#define SSZ5                             BANKMASK(DMAnSSZL), 5, b
#define SSZ6                             BANKMASK(DMAnSSZL), 6, b
#define SSZ7                             BANKMASK(DMAnSSZL), 7, b
#define SSZ8                             BANKMASK(DMAnSSZH), 0, b
#define SSZ9                             BANKMASK(DMAnSSZH), 1, b
#define STAT2                            BANKMASK(ADSTAT), 2, b
#define STATE                            BANKMASK(WDTTMR), 2, b
#define STKOVF                           BANKMASK(PCON0), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKPTR5                          BANKMASK(STKPTR), 5, a
#define STKUNF                           BANKMASK(PCON0), 6, a
#define STP                              BANKMASK(SMT1CON0), 5, b
#define STPT0                            BANKMASK(ADSTPTL), 0, b
#define STPT1                            BANKMASK(ADSTPTL), 1, b
#define STPT10                           BANKMASK(ADSTPTH), 2, b
#define STPT11                           BANKMASK(ADSTPTH), 3, b
#define STPT12                           BANKMASK(ADSTPTH), 4, b
#define STPT13                           BANKMASK(ADSTPTH), 5, b
#define STPT15                           BANKMASK(ADSTPTH), 6, b
#define STPT16                           BANKMASK(ADSTPTH), 7, b
#define STPT2                            BANKMASK(ADSTPTL), 2, b
#define STPT3                            BANKMASK(ADSTPTL), 3, b
#define STPT4                            BANKMASK(ADSTPTL), 4, b
#define STPT5                            BANKMASK(ADSTPTL), 5, b
#define STPT6                            BANKMASK(ADSTPTL), 6, b
#define STPT7                            BANKMASK(ADSTPTL), 7, b
#define STPT8                            BANKMASK(ADSTPTH), 0, b
#define STPT9                            BANKMASK(ADSTPTH), 1, b
#define SWDTEN                           BANKMASK(WDTCON0), 0, b
#define SWIE                             BANKMASK(PIE0), 0, a
#define SWIF                             BANKMASK(PIR0), 0, a
#define SWIP                             BANKMASK(IPR0), 0, b
#define SYSCMD                           BANKMASK(PMD0), 7, b
#define T016BIT                          BANKMASK(T0CON0), 4, b
#define T0ASYNC                          BANKMASK(T0CON1), 4, b
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0, b
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1, b
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2, b
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3, b
#define T0CKIPPS4                        BANKMASK(T0CKIPPS), 4, b
#define T0CKIPPS5                        BANKMASK(T0CKIPPS), 5, b
#define T0CKPS0                          BANKMASK(T0CON1), 0, b
#define T0CKPS1                          BANKMASK(T0CON1), 1, b
#define T0CKPS2                          BANKMASK(T0CON1), 2, b
#define T0CKPS3                          BANKMASK(T0CON1), 3, b
#define T0CS0                            BANKMASK(T0CON1), 5, b
#define T0CS1                            BANKMASK(T0CON1), 6, b
#define T0CS2                            BANKMASK(T0CON1), 7, b
#define T0EN                             BANKMASK(T0CON0), 7, b
#define T0MD16                           BANKMASK(T0CON0), 4, b
#define T0OUT                            BANKMASK(T0CON0), 5, b
#define T0PR0                            BANKMASK(TMR0H), 0, b
#define T0PR1                            BANKMASK(TMR0H), 1, b
#define T0PR2                            BANKMASK(TMR0H), 2, b
#define T0PR3                            BANKMASK(TMR0H), 3, b
#define T0PR4                            BANKMASK(TMR0H), 4, b
#define T0PR5                            BANKMASK(TMR0H), 5, b
#define T0PR6                            BANKMASK(TMR0H), 6, b
#define T0PR7                            BANKMASK(TMR0H), 7, b
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0, b
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1, b
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2, b
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3, b
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4, b
#define T1CKIPPS5                        BANKMASK(T1CKIPPS), 5, b
#define T1CKPS0                          BANKMASK(T1CON), 4, b
#define T1CKPS1                          BANKMASK(T1CON), 5, b
#define T1CS0                            BANKMASK(T1CLK), 0, b
#define T1CS1                            BANKMASK(T1CLK), 1, b
#define T1CS2                            BANKMASK(T1CLK), 2, b
#define T1CS3                            BANKMASK(T1CLK), 3, b
#define T1CS4                            BANKMASK(T1CLK), 4, b
#define T1GE                             BANKMASK(T1GCON), 7, b
#define T1GGO                            BANKMASK(T1GCON), 3, b
#define T1GPOL                           BANKMASK(T1GCON), 6, b
#define T1GPPS0                          BANKMASK(T1GPPS), 0, b
#define T1GPPS1                          BANKMASK(T1GPPS), 1, b
#define T1GPPS2                          BANKMASK(T1GPPS), 2, b
#define T1GPPS3                          BANKMASK(T1GPPS), 3, b
#define T1GPPS4                          BANKMASK(T1GPPS), 4, b
#define T1GSPM                           BANKMASK(T1GCON), 4, b
#define T1GSS0                           BANKMASK(T1GATE), 0, b
#define T1GSS1                           BANKMASK(T1GATE), 1, b
#define T1GSS2                           BANKMASK(T1GATE), 2, b
#define T1GSS3                           BANKMASK(T1GATE), 3, b
#define T1GSS4                           BANKMASK(T1GATE), 4, b
#define T1GSS5                           BANKMASK(T1GATE), 5, b
#define T1GTM                            BANKMASK(T1GCON), 5, b
#define T1GVAL                           BANKMASK(T1GCON), 2, b
#define T1RD16                           BANKMASK(T1CON), 1, b
#define T2CKPOL                          BANKMASK(T2HLT), 6, b
#define T2CKPS0                          BANKMASK(T2CON), 4, b
#define T2CKPS1                          BANKMASK(T2CON), 5, b
#define T2CKPS2                          BANKMASK(T2CON), 6, b
#define T2CKSYNC                         BANKMASK(T2HLT), 5, b
#define T2CS0                            BANKMASK(T2CLKCON), 0, b
#define T2CS1                            BANKMASK(T2CLKCON), 1, b
#define T2CS2                            BANKMASK(T2CLKCON), 2, b
#define T2CS3                            BANKMASK(T2CLKCON), 3, b
#define T2CS4                            BANKMASK(T2CLKCON), 4, b
#define T2CS5                            BANKMASK(T2CLKCON), 5, b
#define T2INPPS0                         BANKMASK(T2INPPS), 0, b
#define T2INPPS1                         BANKMASK(T2INPPS), 1, b
#define T2INPPS2                         BANKMASK(T2INPPS), 2, b
#define T2INPPS3                         BANKMASK(T2INPPS), 3, b
#define T2INPPS4                         BANKMASK(T2INPPS), 4, b
#define T2MODE0                          BANKMASK(T2HLT), 0, b
#define T2MODE1                          BANKMASK(T2HLT), 1, b
#define T2MODE2                          BANKMASK(T2HLT), 2, b
#define T2MODE3                          BANKMASK(T2HLT), 3, b
#define T2MODE4                          BANKMASK(T2HLT), 4, b
#define T2ON                             BANKMASK(T2CON), 7, b
#define T2OUTPS0                         BANKMASK(T2CON), 0, b
#define T2OUTPS1                         BANKMASK(T2CON), 1, b
#define T2OUTPS2                         BANKMASK(T2CON), 2, b
#define T2OUTPS3                         BANKMASK(T2CON), 3, b
#define T2PSYNC                          BANKMASK(T2HLT), 7, b
#define T2RSEL0                          BANKMASK(T2RST), 0, b
#define T2RSEL1                          BANKMASK(T2RST), 1, b
#define T2RSEL2                          BANKMASK(T2RST), 2, b
#define T2RSEL3                          BANKMASK(T2RST), 3, b
#define T2RSEL4                          BANKMASK(T2RST), 4, b
#define T2RSEL5                          BANKMASK(T2RST), 5, b
#define T2RSEL6                          BANKMASK(T2RST), 6, b
#define T3CKIPPS0                        BANKMASK(T3CKIPPS), 0, b
#define T3CKIPPS1                        BANKMASK(T3CKIPPS), 1, b
#define T3CKIPPS2                        BANKMASK(T3CKIPPS), 2, b
#define T3CKIPPS3                        BANKMASK(T3CKIPPS), 3, b
#define T3CKIPPS4                        BANKMASK(T3CKIPPS), 4, b
#define T3CKIPPS5                        BANKMASK(T3CKIPPS), 5, b
#define T3CKPS0                          BANKMASK(T3CON), 4, b
#define T3CKPS1                          BANKMASK(T3CON), 5, b
#define T3CS0                            BANKMASK(T3CLK), 0, b
#define T3CS1                            BANKMASK(T3CLK), 1, b
#define T3CS2                            BANKMASK(T3CLK), 2, b
#define T3CS3                            BANKMASK(T3CLK), 3, b
#define T3CS4                            BANKMASK(T3CLK), 4, b
#define T3GE                             BANKMASK(T3GCON), 7, b
#define T3GGO                            BANKMASK(T3GCON), 3, b
#define T3GPOL                           BANKMASK(T3GCON), 6, b
#define T3GPPS0                          BANKMASK(T3GPPS), 0, b
#define T3GPPS1                          BANKMASK(T3GPPS), 1, b
#define T3GPPS2                          BANKMASK(T3GPPS), 2, b
#define T3GPPS3                          BANKMASK(T3GPPS), 3, b
#define T3GPPS4                          BANKMASK(T3GPPS), 4, b
#define T3GSPM                           BANKMASK(T3GCON), 4, b
#define T3GSS0                           BANKMASK(T3GATE), 0, b
#define T3GSS1                           BANKMASK(T3GATE), 1, b
#define T3GSS2                           BANKMASK(T3GATE), 2, b
#define T3GSS3                           BANKMASK(T3GATE), 3, b
#define T3GSS4                           BANKMASK(T3GATE), 4, b
#define T3GSS5                           BANKMASK(T3GATE), 5, b
#define T3GTM                            BANKMASK(T3GCON), 5, b
#define T3GVAL                           BANKMASK(T3GCON), 2, b
#define T3RD16                           BANKMASK(T3CON), 1, b
#define T4CKPOL                          BANKMASK(T4HLT), 6, b
#define T4CKPS0                          BANKMASK(T4CON), 4, b
#define T4CKPS1                          BANKMASK(T4CON), 5, b
#define T4CKPS2                          BANKMASK(T4CON), 6, b
#define T4CKSYNC                         BANKMASK(T4HLT), 5, b
#define T4CS0                            BANKMASK(T4CLKCON), 0, b
#define T4CS1                            BANKMASK(T4CLKCON), 1, b
#define T4CS2                            BANKMASK(T4CLKCON), 2, b
#define T4CS3                            BANKMASK(T4CLKCON), 3, b
#define T4CS4                            BANKMASK(T4CLKCON), 4, b
#define T4CS5                            BANKMASK(T4CLKCON), 5, b
#define T4INPPS0                         BANKMASK(T4INPPS), 0, b
#define T4INPPS1                         BANKMASK(T4INPPS), 1, b
#define T4INPPS2                         BANKMASK(T4INPPS), 2, b
#define T4INPPS3                         BANKMASK(T4INPPS), 3, b
#define T4INPPS4                         BANKMASK(T4INPPS), 4, b
#define T4MODE0                          BANKMASK(T4HLT), 0, b
#define T4MODE1                          BANKMASK(T4HLT), 1, b
#define T4MODE2                          BANKMASK(T4HLT), 2, b
#define T4MODE3                          BANKMASK(T4HLT), 3, b
#define T4MODE4                          BANKMASK(T4HLT), 4, b
#define T4ON                             BANKMASK(T4CON), 7, b
#define T4OUTPS0                         BANKMASK(T4CON), 0, b
#define T4OUTPS1                         BANKMASK(T4CON), 1, b
#define T4OUTPS2                         BANKMASK(T4CON), 2, b
#define T4OUTPS3                         BANKMASK(T4CON), 3, b
#define T4PSYNC                          BANKMASK(T4HLT), 7, b
#define T4RSEL0                          BANKMASK(T4RST), 0, b
#define T4RSEL1                          BANKMASK(T4RST), 1, b
#define T4RSEL2                          BANKMASK(T4RST), 2, b
#define T4RSEL3                          BANKMASK(T4RST), 3, b
#define T4RSEL4                          BANKMASK(T4RST), 4, b
#define T4RSEL5                          BANKMASK(T4RST), 5, b
#define T4RSEL6                          BANKMASK(T4RST), 6, b
#define T5CKIPPS0                        BANKMASK(T5CKIPPS), 0, b
#define T5CKIPPS1                        BANKMASK(T5CKIPPS), 1, b
#define T5CKIPPS2                        BANKMASK(T5CKIPPS), 2, b
#define T5CKIPPS3                        BANKMASK(T5CKIPPS), 3, b
#define T5CKIPPS4                        BANKMASK(T5CKIPPS), 4, b
#define T5CKIPPS5                        BANKMASK(T5CKIPPS), 5, b
#define T5CKPS0                          BANKMASK(T5CON), 4, b
#define T5CKPS1                          BANKMASK(T5CON), 5, b
#define T5CS0                            BANKMASK(T5CLK), 0, b
#define T5CS1                            BANKMASK(T5CLK), 1, b
#define T5CS2                            BANKMASK(T5CLK), 2, b
#define T5CS3                            BANKMASK(T5CLK), 3, b
#define T5CS4                            BANKMASK(T5CLK), 4, b
#define T5GE                             BANKMASK(T5GCON), 7, b
#define T5GGO                            BANKMASK(T5GCON), 3, b
#define T5GPOL                           BANKMASK(T5GCON), 6, b
#define T5GPPS0                          BANKMASK(T5GPPS), 0, b
#define T5GPPS1                          BANKMASK(T5GPPS), 1, b
#define T5GPPS2                          BANKMASK(T5GPPS), 2, b
#define T5GPPS3                          BANKMASK(T5GPPS), 3, b
#define T5GPPS4                          BANKMASK(T5GPPS), 4, b
#define T5GSPM                           BANKMASK(T5GCON), 4, b
#define T5GSS0                           BANKMASK(T5GATE), 0, b
#define T5GSS1                           BANKMASK(T5GATE), 1, b
#define T5GSS2                           BANKMASK(T5GATE), 2, b
#define T5GSS3                           BANKMASK(T5GATE), 3, b
#define T5GSS4                           BANKMASK(T5GATE), 4, b
#define T5GSS5                           BANKMASK(T5GATE), 5, b
#define T5GTM                            BANKMASK(T5GCON), 5, b
#define T5GVAL                           BANKMASK(T5GCON), 2, b
#define T5RD16                           BANKMASK(T5CON), 1, b
#define T6CKPOL                          BANKMASK(T6HLT), 6, b
#define T6CKPS0                          BANKMASK(T6CON), 4, b
#define T6CKPS1                          BANKMASK(T6CON), 5, b
#define T6CKPS2                          BANKMASK(T6CON), 6, b
#define T6CKSYNC                         BANKMASK(T6HLT), 5, b
#define T6CS0                            BANKMASK(T6CLKCON), 0, b
#define T6CS1                            BANKMASK(T6CLKCON), 1, b
#define T6CS2                            BANKMASK(T6CLKCON), 2, b
#define T6CS3                            BANKMASK(T6CLKCON), 3, b
#define T6CS4                            BANKMASK(T6CLKCON), 4, b
#define T6CS5                            BANKMASK(T6CLKCON), 5, b
#define T6INPPS0                         BANKMASK(T6INPPS), 0, b
#define T6INPPS1                         BANKMASK(T6INPPS), 1, b
#define T6INPPS2                         BANKMASK(T6INPPS), 2, b
#define T6INPPS3                         BANKMASK(T6INPPS), 3, b
#define T6INPPS4                         BANKMASK(T6INPPS), 4, b
#define T6MODE0                          BANKMASK(T6HLT), 0, b
#define T6MODE1                          BANKMASK(T6HLT), 1, b
#define T6MODE2                          BANKMASK(T6HLT), 2, b
#define T6MODE3                          BANKMASK(T6HLT), 3, b
#define T6MODE4                          BANKMASK(T6HLT), 4, b
#define T6ON                             BANKMASK(T6CON), 7, b
#define T6OUTPS0                         BANKMASK(T6CON), 0, b
#define T6OUTPS1                         BANKMASK(T6CON), 1, b
#define T6OUTPS2                         BANKMASK(T6CON), 2, b
#define T6OUTPS3                         BANKMASK(T6CON), 3, b
#define T6PSYNC                          BANKMASK(T6HLT), 7, b
#define T6RSEL0                          BANKMASK(T6RST), 0, b
#define T6RSEL1                          BANKMASK(T6RST), 1, b
#define T6RSEL2                          BANKMASK(T6RST), 2, b
#define T6RSEL3                          BANKMASK(T6RST), 3, b
#define T6RSEL4                          BANKMASK(T6RST), 4, b
#define T6RSEL5                          BANKMASK(T6RST), 5, b
#define T6RSEL6                          BANKMASK(T6RST), 6, b
#define TMD0                             BANKMASK(ADCON3), 0, b
#define TMD1                             BANKMASK(ADCON3), 1, b
#define TMD2                             BANKMASK(ADCON3), 2, b
#define TMR0H0                           BANKMASK(TMR0H), 0, b
#define TMR0H1                           BANKMASK(TMR0H), 1, b
#define TMR0H2                           BANKMASK(TMR0H), 2, b
#define TMR0H3                           BANKMASK(TMR0H), 3, b
#define TMR0H4                           BANKMASK(TMR0H), 4, b
#define TMR0H5                           BANKMASK(TMR0H), 5, b
#define TMR0H6                           BANKMASK(TMR0H), 6, b
#define TMR0H7                           BANKMASK(TMR0H), 7, b
#define TMR0IE                           BANKMASK(PIE3), 7, a
#define TMR0IF                           BANKMASK(PIR3), 7, a
#define TMR0IP                           BANKMASK(IPR3), 7, b
#define TMR0L0                           BANKMASK(TMR0L), 0, b
#define TMR0L1                           BANKMASK(TMR0L), 1, b
#define TMR0L2                           BANKMASK(TMR0L), 2, b
#define TMR0L3                           BANKMASK(TMR0L), 3, b
#define TMR0L4                           BANKMASK(TMR0L), 4, b
#define TMR0L5                           BANKMASK(TMR0L), 5, b
#define TMR0L6                           BANKMASK(TMR0L), 6, b
#define TMR0L7                           BANKMASK(TMR0L), 7, b
#define TMR0MD                           BANKMASK(PMD1), 0, b
#define TMR1GIE                          BANKMASK(PIE3), 5, a
#define TMR1GIF                          BANKMASK(PIR3), 5, a
#define TMR1GIP                          BANKMASK(IPR3), 5, b
#define TMR1H0                           BANKMASK(TMR1H), 0, b
#define TMR1H1                           BANKMASK(TMR1H), 1, b
#define TMR1H2                           BANKMASK(TMR1H), 2, b
#define TMR1H3                           BANKMASK(TMR1H), 3, b
#define TMR1H4                           BANKMASK(TMR1H), 4, b
#define TMR1H5                           BANKMASK(TMR1H), 5, b
#define TMR1H6                           BANKMASK(TMR1H), 6, b
#define TMR1H7                           BANKMASK(TMR1H), 7, b
#define TMR1IE                           BANKMASK(PIE3), 4, a
#define TMR1IF                           BANKMASK(PIR3), 4, a
#define TMR1IP                           BANKMASK(IPR3), 4, b
#define TMR1L0                           BANKMASK(TMR1L), 0, b
#define TMR1L1                           BANKMASK(TMR1L), 1, b
#define TMR1L2                           BANKMASK(TMR1L), 2, b
#define TMR1L3                           BANKMASK(TMR1L), 3, b
#define TMR1L4                           BANKMASK(TMR1L), 4, b
#define TMR1L5                           BANKMASK(TMR1L), 5, b
#define TMR1L6                           BANKMASK(TMR1L), 6, b
#define TMR1L7                           BANKMASK(TMR1L), 7, b
#define TMR1MD                           BANKMASK(PMD1), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, b
#define TMR2IE                           BANKMASK(PIE3), 3, a
#define TMR2IF                           BANKMASK(PIR3), 3, a
#define TMR2IP                           BANKMASK(IPR3), 3, b
#define TMR2MD                           BANKMASK(PMD1), 2, b
#define TMR2ON                           BANKMASK(T2CON), 7, b
#define TMR3GIE                          BANKMASK(PIE5), 5, a
#define TMR3GIF                          BANKMASK(PIR5), 5, a
#define TMR3GIP                          BANKMASK(IPR5), 5, b
#define TMR3H0                           BANKMASK(TMR3H), 0, b
#define TMR3H1                           BANKMASK(TMR3H), 1, b
#define TMR3H2                           BANKMASK(TMR3H), 2, b
#define TMR3H3                           BANKMASK(TMR3H), 3, b
#define TMR3H4                           BANKMASK(TMR3H), 4, b
#define TMR3H5                           BANKMASK(TMR3H), 5, b
#define TMR3H6                           BANKMASK(TMR3H), 6, b
#define TMR3H7                           BANKMASK(TMR3H), 7, b
#define TMR3IE                           BANKMASK(PIE5), 4, a
#define TMR3IF                           BANKMASK(PIR5), 4, a
#define TMR3IP                           BANKMASK(IPR5), 4, b
#define TMR3L0                           BANKMASK(TMR3L), 0, b
#define TMR3L1                           BANKMASK(TMR3L), 1, b
#define TMR3L2                           BANKMASK(TMR3L), 2, b
#define TMR3L3                           BANKMASK(TMR3L), 3, b
#define TMR3L4                           BANKMASK(TMR3L), 4, b
#define TMR3L5                           BANKMASK(TMR3L), 5, b
#define TMR3L6                           BANKMASK(TMR3L), 6, b
#define TMR3L7                           BANKMASK(TMR3L), 7, b
#define TMR3MD                           BANKMASK(PMD1), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, b
#define TMR4IE                           BANKMASK(PIE11), 3, a
#define TMR4IF                           BANKMASK(PIR11), 3, a
#define TMR4IP                           BANKMASK(IPR11), 3, b
#define TMR4MD                           BANKMASK(PMD1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 7, b
#define TMR5GIE                          BANKMASK(PIE8), 5, a
#define TMR5GIF                          BANKMASK(PIR8), 5, a
#define TMR5GIP                          BANKMASK(IPR8), 5, b
#define TMR5H0                           BANKMASK(TMR5H), 0, b
#define TMR5H1                           BANKMASK(TMR5H), 1, b
#define TMR5H2                           BANKMASK(TMR5H), 2, b
#define TMR5H3                           BANKMASK(TMR5H), 3, b
#define TMR5H4                           BANKMASK(TMR5H), 4, b
#define TMR5H5                           BANKMASK(TMR5H), 5, b
#define TMR5H6                           BANKMASK(TMR5H), 6, b
#define TMR5H7                           BANKMASK(TMR5H), 7, b
#define TMR5IE                           BANKMASK(PIE8), 4, a
#define TMR5IF                           BANKMASK(PIR8), 4, a
#define TMR5IP                           BANKMASK(IPR8), 4, b
#define TMR5L0                           BANKMASK(TMR5L), 0, b
#define TMR5L1                           BANKMASK(TMR5L), 1, b
#define TMR5L2                           BANKMASK(TMR5L), 2, b
#define TMR5L3                           BANKMASK(TMR5L), 3, b
#define TMR5L4                           BANKMASK(TMR5L), 4, b
#define TMR5L5                           BANKMASK(TMR5L), 5, b
#define TMR5L6                           BANKMASK(TMR5L), 6, b
#define TMR5L7                           BANKMASK(TMR5L), 7, b
#define TMR5MD                           BANKMASK(PMD1), 5, b
#define TMR5ON                           BANKMASK(T5CON), 0, b
#define TMR6IE                           BANKMASK(PIE15), 3, a
#define TMR6IF                           BANKMASK(PIR15), 3, a
#define TMR6IP                           BANKMASK(IPR15), 3, b
#define TMR6MD                           BANKMASK(PMD1), 6, b
#define TMR6ON                           BANKMASK(T6CON), 7, b
#define TRIGEN                           BANKMASK(SCANCON0), 6, b
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
